<template>
  <div>
    <header class="flex flex-col items-start">
      <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 5</p></TopHeader>
      <MainHeader class="max-w-[900px]" bg-color="primary">Что такое ОЦИБ</MainHeader>
      <MainHeader class="max-w-[900px]" bg-color="secondary">зачем и кому нужен?</MainHeader>
      <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
        <p class="font-inter text-sm">
          <a :href="links['ОЦИБ']" target="_blank">Оперативный центр информационной безопасности</a>(далее - ОЦИБ) — юридическое лицо или структурное подразделение юридического лица, осуществляющее деятельность по защите электронных информационных ресурсов, информационных систем, сетей телекоммуникаций и
          других объектов информатизации.
        </p>
      </div>
    </header>
    <main class="my-9">
      <ConclusionContainer title="ВЫВОД № 12:">
        <template #default>
          <div class="p-8 font-inter max-md:p-4">
            <div class="space-y-6">
              <p>
                ОЦИБ аналогичен зарубежным пунктам управления информационной безопасностью (Security Operations Centers
                - SOC). Он отвечает за оперативный мониторинг информационной среды и предотвращение инцидентов
                безопасности.
              </p>
              <p>
                Если совсем просто, то специалисты ОЦИБ собирают и анализируют данные с различных объектов
                инфраструктуры и при обнаружении подозрительной активности принимают меры для предотвращения атак.
              </p>
              <p>
                Деятельность ОЦИБ возможна только при наличии <a href="https://elicense.kz/LicensingContent/Passport?servicesType=LicenseEl3&servicesParameters=%7B%22ActivityTypeId%22%3A%2228014%22%7D" target="_blank">лицензии, выдаваемой Комитетом национальной безопасности РК</a>. Однако данное требование не распространяется на правоохранительные и специальные государственные
                органы, а также банки второго уровня, у которых функции ОЦИБ выполняются внутренними структурными
                подразделениями. Общий порядок лицензирования данной сферы регулируется <a :href="links['Законом РК О разрешениях и уведомлениях']" target="_blank">Законом РК “О разрешениях и уведомлениях”</a>.
              </p>
            </div>
            <ArticleAlert type="question" class="mt-8">
              <template #title>
                <p class="text-lg text-white font-inter font-bold">Зачем нужен ОЦИБ?</p>
              </template>
            </ArticleAlert>
            <p class="mt-4">
              Простыми словами, ОЦИБ нужен для защиты компьютерных систем и данных от злоумышленников, чтобы они не
              смогли взломать или повредить информацию.
            </p>
            <h2 class="text-[25px] font-extrabold text-center mt-16">
              Кому нужен <span class="text-main-purple">ОЦИБ</span>?
            </h2>
            <div class="grid grid-cols-3 gap-6 font-inter mt-8 max-xl:grid-cols-2 max-md:grid-cols-1">
              <div
                v-for="item in whoNeedsOCIB"
                :key="item.title"
                class="p-5 bg-[#E1FFA8] xl:even:bg-main-purple max-md:even:bg-main-purple group md:max-xl:[&:nth-child(4n-2)]:bg-main-purple md:max-xl:[&:nth-child(4n-1)]:bg-main-purple 
                md:max-xl:[&:nth-child(4n-2)>*]:text-white md:max-xl:[&:nth-child(4n-1)>*]:text-white">
                <h3 class="font-bold text-[#43512A] group-even:xl:text-white max-md:group-even:max-md:text-white">
                  {{ item.title }}
                </h3>
                <p class="mt-[15px] text-xs text-black group-even:xl:text-white group-even:max-md:text-white">
                  {{ item.note }}
                </p>
              </div>
            </div>
            <ArticleAlert type="question" class="mt-20">
              <template #title>
                <p class="text-lg text-white font-inter font-bold">Как выбрать грамотного поставщика услуги ОЦИБ?</p>
              </template>
            </ArticleAlert>
            <p class="mt-6">
              Как мы ранее рассказывали, ОЦИБ может функционировать только на основании лицензии от органов национальной безопасности РК, и согласно действующим НПА это является основным требованием к нему.
            </p>
            <p class="mt-6">
              Однако на практике встречаются ОЦИБ, которые получили лицензию на основе арендованных средств защиты информации (СЗИ) и временных специалистов ИБ, но не вкладывают достаточно в развитие своего ОЦИБ. Факт получения лицензии не всегда коррелирует с качеством услуг, что оказывает негативное влияние на рынок: снижается качество предоставляемых услуг и их стоимость. Это приводит к тому, что качество услуг становится формальным, поэтому потенциальный Заказчик должен тщательно проверить потенциального Поставщика.
            </p>
            <h2 class="text-[25px] font-extrabold text-center mt-6 max-w-[630px] mx-auto">
              <span class="text-main-purple">Рекомендации (лайфхаки)</span> для подбора потенциального поставщика услуг
            </h2>
            <ul class="font-inter space-y-4">
              <li v-for="item in recommendationsForSelection" :key="item.title" class="flex items-start gap-6 mt-9">
                <svg
                  class="shrink-0 grow-0"
                  width="44"
                  height="44"
                  viewBox="0 0 44 44"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M42 22C42 25.75 40.95 29.3 39.1 32.3C35.65 38.1 29.3 42 22 42C14.7 42 8.35001 38.1 4.90001 32.3C3.05001 29.3 2 25.75 2 22C2 10.95 10.95 2 22 2C33.05 2 42 10.95 42 22Z"
                    stroke="#916AE9"
                    stroke-width="2.5"
                    stroke-miterlimit="10"
                    stroke-linecap="round"
                    stroke-linejoin="round" />
                  <path
                    d="M14.207 21.9976L19.157 26.9475L29.807 17.0977"
                    stroke="#916AE9"
                    stroke-width="2.5"
                    stroke-linecap="round"
                    stroke-linejoin="round" />
                </svg>
                <div>
                  <p class="font-bold text-main-purple">{{ item.title }}</p>
                  <p>{{ item.note }}</p>
                </div>
              </li>
            </ul>
            <ArticleAlert type="info" title="Примечание:" class="mt-[38px]">
              <template #default>
                <p class="text-sm text-black font-inter font-light">
                  Перечень организаций, имеющих лицензии на предоставление услуг ОЦИБ, находится
                  <a
                    class="underline"
                    target="_blank"
                    href="https://www.gov.kz/memleket/entities/mdai/press/article/details/122130?lang=ru"
                    >на сайте МЦРИАП РК</a
                  >
                  или
                  <a
                    class="underline"
                    target="_blank"
                    href="https://www.gov.kz/memleket/entities/mdai/press/article/details/122130?lang=ru"
                    >на сайте ГТС КНБ</a
                  >.
                </p>
              </template>
            </ArticleAlert>
            <div>
              <h2 class="text-xl font-extrabold text-center mt-12 max-w-[850px] mx-auto">
                <span class="bg-black text-[#E1FFA8] px-1">Требования к поставщикам услуг</span> оперативного центра
                информационной безопасности (ОЦИБ) которые помогут вам получить качественную услугу:
              </h2>
              <ol class="space-y-5 mt-8">
                <li v-for="(item, idx) in requirementsForService" :key="item.title" class="flex gap-[25px] items-start">
                  <div
                    class="size-[50px] border-2 border-black bg-[#E1FFA8] font-extrabold text-[25px] flex items-center justify-center shrink-0">
                    {{ idx + 1 }}
                  </div>
                  <div>
                    <span class="bg-black font-bold text-[#E1FFA8] px-1 py-px">{{ item.title }}</span>
                    <p class="text-black mt-1">{{ item.note }}</p>
                  </div>
                </li>
              </ol>
            </div>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Мы выяснили, что ОЦИБ — это важный аспект в обеспечении безопасности информационных систем, обнаружении и
            реагировании на потенциальные угрозы, а также разработке стратегий по защите информационных активов.
            Понимание роли и функций ОЦИБ поможет организациям эффективно защищать свои данные и минимизировать риски
            безопасности.
          </p>
        </template>
      </ConclusionContainer>
    </main>
  </div>
</template>

<script setup lang="ts">
import MainHeader from '~/shared/components/headers/MainHeader.vue';
import TopHeader from '~/shared/components/headers/TopHeader.vue';
import ArticleAlert from '~/pages/methodology/_block/article-alert.vue';
import ConclusionContainer from '~/pages/methodology/_block/conclusion-container.vue';

const links = {
  ОЦИБ: "https://adilet.zan.kz/rus/docs/Z1500000418#:~:text=30%2D6)%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%B8%D0%B2%D0%BD%D1%8B%D0%B9%20%D1%86%D0%B5%D0%BD%D1%82%D1%80%20%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D0%BE%D0%B9%20%D0%B1%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%E2%80%93%20%D1%8E%D1%80%D0%B8%D0%B4%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B5%20%D0%BB%D0%B8%D1%86%D0%BE%20%D0%B8%D0%BB%D0%B8%20%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D0%BD%D0%BE%D0%B5%20%D0%BF%D0%BE%D0%B4%D1%80%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5%20%D1%8E%D1%80%D0%B8%D0%B4%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%BE%D0%B3%D0%BE%20%D0%BB%D0%B8%D1%86%D0%B0%2C%20%D0%BE%D1%81%D1%83%D1%89%D0%B5%D1%81%D1%82%D0%B2%D0%BB%D1%8F%D1%8E%D1%89%D0%B5%D0%B5%20%D0%B4%D0%B5%D1%8F%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D1%8C%20%D0%BF%D0%BE%20%D0%B7%D0%B0%D1%89%D0%B8%D1%82%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D0%BD%D0%BD%D1%8B%D1%85%20%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D1%8B%D1%85%20%D1%80%D0%B5%D1%81%D1%83%D1%80%D1%81%D0%BE%D0%B2%2C%20%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D1%8B%D1%85%20%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%2C%20%D1%81%D0%B5%D1%82%D0%B5%D0%B9%20%D1%82%D0%B5%D0%BB%D0%B5%D0%BA%D0%BE%D0%BC%D0%BC%D1%83%D0%BD%D0%B8%D0%BA%D0%B0%D1%86%D0%B8%D0%B9%20%D0%B8%20%D0%B4%D1%80%D1%83%D0%B3%D0%B8%D1%85%20%D0%BE%D0%B1%D1%8A%D0%B5%D0%BA%D1%82%D0%BE%D0%B2%20%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%82%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8%3B",
  "Законом РК О разрешениях и уведомлениях": "https://adilet.zan.kz/rus/docs/Z1400000202#:~:text=%D0%9B%D0%B8%D1%86%D0%B5%D0%BD%D0%B7%D0%B8%D1%8F%20%D0%BD%D0%B0%20%D0%BE%D0%BA%D0%B0%D0%B7%D0%B0%D0%BD%D0%B8%D0%B5%20%D1%83%D1%81%D0%BB%D1%83%D0%B3%20%D0%BF%D0%BE%20%D0%B2%D1%8B%D1%8F%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D1%8E%20%D1%82%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85%20%D0%BA%D0%B0%D0%BD%D0%B0%D0%BB%D0%BE%D0%B2%20%D1%83%D1%82%D0%B5%D1%87%D0%BA%D0%B8%20%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%B8%20%D0%B8%20%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D1%85%20%D1%82%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85%20%D1%81%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B2,%20%D0%BF%D1%80%D0%B5%D0%B4%D0%BD%D0%B0%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D0%BD%D0%BD%D1%8B%D1%85%20%D0%B4%D0%BB%D1%8F%20%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D1%8F%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%B8%D0%B2%D0%BD%D0%BE-%D1%80%D0%BE%D0%B7%D1%8B%D1%81%D0%BA%D0%BD%D1%8B%D1%85%20%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D1%80%D0%B8%D1%8F%D1%82%D0%B8%D0%B9",
};

interface DataLocale {
  title: string;
  note: string;
}

const whoNeedsOCIB = [
  {
    title: 'Организации с критически важной информационной инфраструктурой',
    note: 'Таким как государственные учреждения, финансовые учреждения, а также частным предприятиям, у которых есть функция оказания государственных услуг.',
  },
  {
    title: 'Телекоммуникационные компании',
    note: 'Эти организации обрабатывают огромное количество данных и должны защищать информацию своих клиентов от утечек и кибератак.',
  },
  {
    title: 'Энергетические компании',
    note: 'Электростанции, распределительные сети и другие объекты энергетической инфраструктуры также являются привлекательными целями для кибератак.',
  },
  {
    title: 'Медицинские учреждения и компании',
    note: 'Больницы, клиники и компании, занимающиеся хранением и обработкой медицинских данных, нуждаются в защите персональной информации пациентов и предотвращении кибератак.',
  },
  {
    title: 'Образовательные учреждения',
    note: 'Университеты и школы все чаще становятся целями киберпреступников, поэтому защита данных студентов и исследовательской информации имеет большое значение.',
  },
  {
    title: 'Производственные компании',
    note: 'Современные производственные процессы все чаще зависят от компьютерных систем и Интернета вещей (IoT), что делает их уязвимыми для кибератак.',
  },
  {
    title: 'Транспортные компании',
    note: 'Авиакомпании, железнодорожные и автомобильные перевозчики, а также порты и терминалы нуждаются в защите своих информационных систем от угроз.',
  },
  {
    title: 'Торговые компании (ритейл)',
    note: 'Большие торговые сети, особенно те, которые занимаются электронной коммерцией, нуждаются в защите от утечек данных клиентов и финансовых транзакций.',
  },
  {
    title: 'Медиа и развлекательные компании',
    note: 'Компании, занимающиеся созданием и распространением медийного контента, должны защищать свою интеллектуальную собственность и данные пользователей.',
  },
  {
    title: 'Технологические компании',
    note: 'Разработчики ПО, интернет-сервисы и другие технологические компании часто становятся целями атак, нацеленных на получение доступа к исходному коду и конфиденциальным данным.',
  },
  {
    title: 'Некоммерческие организации и НКО',
    note: 'Эти организации могут быть мишенями кибератак из-за своей политической или социальной активности, особенно в условиях конфликта или нестабильности.',
  },
  {
    title: 'Агропромышленные компании',
    note: 'Сельскохозяйственные предприятия, использующие современные технологии и системы управления, также могут подвергаться кибератакам.',
  },
];

const recommendationsForSelection = [
  {
    title: 'Мониторинг событий ИБ 24/7 365 дней в году:',
    note: 'Злоумышленники на другой стороне нашей планеты не будут ждать наступления рабочего времени в вашем часовом поясе, чтобы попытаться создать проблемы.',
  },
  {
    title: 'Соответствие требованиям Приказа №52 по правилам МОИБ: ',
    note: 'Поставщик должен обеспечить сбор нужных событий (логирование) по информационной безопасности.',
  },
  {
    title: 'Хранение журналов регистрации событий не менее трёх лет: ',
    note: 'Это создаёт условия для хронологического анализа при необходимости.',
  },
  {
    title: 'Удалённый доступ к системе мониторинга событий ИБ: ',
    note: 'Поставщик должен предоставить ответственным лицам вашей организации удалённый доступ для регулярного объективного контроля.',
  },
  {
    title: 'Совместные мероприятия по реагированию на инциденты ИБ: ',
    note: 'Информация о выявляемых аномальных событиях (потенциальных угрозах ИБ) должна направляться ответственным лицам вашей организации для подтверждения (опровержения) инцидента. Любая нелегитимная активность в сетях должна изолироваться и нейтрализоваться.',
  },
  {
    title: 'Профессиональное объяснение причин инцидента ИБ: ',
    note: 'Поставщик должен качественно выполнять свою работу, а также объяснять причины возникновения инцидента ИБ и выдавать рекомендации по предотвращению будущих инцидентов.',
  },
  {
    title: 'Штатный персонал и собственные средства защиты: ',
    note: 'Поставщик должен обладать штатным персоналом и собственным комплексом программных и программно-аппаратных средств защиты, а не арендованными на период получения лицензии и проведения конкурсных процедур.',
  },
  {
    title: 'Проверка отзывов от действующих и бывших клиентов: ',
    note: 'Установите рабочие контакты с ответственными работниками за ИБ в этих организациях и наведите у них справки о поставщике.',
  },
  {
    title: 'Анализ стажа и текучести кадров у поставщика: ',
    note: 'Обратите внимание на стаж трудовой деятельности специалистов по ИБ и текучесть кадров. Если есть возможность, пообщайтесь с бывшими работниками.',
  },
  {
    title: 'Нанимайте опытного консультанта при необходимости: ',
    note: 'Если вы впервые сталкиваетесь с процедурами приобретения услуг по ИБ, лучше наймите опытного консультанта для этих целей.',
  },
];

const requirementsForService = [
  {
    title: 'Инвентаризация информационных активов',
    note: 'Поставщик должен провести инвентаризацию и предоставить актуальные сведения о количестве объектов инфраструктуры, их типах, используемых операционных системах и их версиях.',
  },
  {
    title: 'Категоризация активов',
    note: 'Поставщик должен выполнить категоризацию объектов информатизации согласно законодательству Республики Казахстан.',
  },
  {
    title: 'Аудит инфраструктуры',
    note: 'Поставщик обязан провести аудит на соответствие требованиям информационной безопасности, выявить несоответствия нормативно-правовым актам и стандартам, а также оценить полноту оснащенности средствами защиты.',
  },
  {
    title: 'Выдача рекомендаций',
    note: 'Поставщик должен предоставить рекомендации по исправлению выявленных замечаний, особенно тех, которые требуют финансовых затрат со стороны заказчика.',
  },
  {
    title: 'Исправление замечаний',
    note: 'Поставщик совместно с ответственными лицами заказчика должен исправить замечания, не требующие дополнительных финансовых затрат.',
  },
  {
    title: 'Подключение к средствам мониторинга',
    note: 'Поставщик должен подключить объекты к средствам мониторинга ОЦИБ с момента начала действия договора и адаптировать правила выявления аномальных событий информационной безопасности.',
  },
  {
    title: 'Мониторинг событий информационной безопасности',
    note: 'Поставщик обязан обеспечить 24/7 мониторинг событий ИБ, хранить журналы регистраций не менее трёх лет и предоставить удалённый доступ к системе мониторинга.',
  },
  {
    title: 'Реагирование на инциденты',
    note: 'Поставщик должен совместно с ответственными лицами заказчика реагировать на инциденты ИБ, проводить первичный анализ и предоставлять план реагирования.',
  },
  {
    title: 'Анализ инцидентов',
    note: 'Поставщик обязан проводить анализ цифровых следов, предоставлять отчёты с описанием инцидентов, причин их возникновения и рекомендациями по недопущению повторения.',
  },
];
</script>

<style scoped>
a {
  text-decoration-line: underline;
}
</style>
