<template>
  <div>
    <header class="flex flex-col items-start">
      <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 8</p></TopHeader>
      <MainHeader class="" bg-color="primary">Что такое инструментальное обследование</MainHeader>
      <MainHeader class="max-w-[900px]" bg-color="secondary">компонентов информационных систем?</MainHeader>
      <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
        <p class="font-inter text-sm">
          Инструментальное обследование компонентов информационных систем (далее — пентест или тестирование на
          проникновение) представляет собой контролируемую атаку на информационную систему с целью выявления её
          уязвимостей и оценки уровня защищенности. Этот процесс позволяет смоделировать действия потенциального
          злоумышленника и выявить слабые места в системе, которые могут быть использованы для несанкционированного
          доступа или кибератак.
        </p>
      </div>
    </header>
    <main class="my-9">
      <ConclusionContainer title="ВЫВОД № 15:">
        <template #default>
          <div class="p-8 font-inter max-md:p-4">
            <ArticleAlert type="question">
              <template #title>
                <p class="text-lg text-white font-inter font-bold">Кто проводит пентест?</p>
              </template>
            </ArticleAlert>
            <p class="p-6 max-md:p-0 max-md:mt-4">
              Пентест обычно проводят сертифицированные специалисты в области информационной безопасности или специализированные организации/компании по проведению тестирования на проникновение. Эти специалисты обладают необходимыми знаниями, навыками и инструментами для эффективного анализа системы на предмет уязвимостей.
            </p>
            <p class="p-6 pt-0 max-md:p-0 max-md:mt-4">
              К примеру: оперативные центры информационной безопасности, службы реагирования на инциденты информационной безопасности, эксперты-аудиторы и другие специалисты, имеющие международные сертификаты (ISO и др.).
            </p>
            <div>
              <h2 class="h2">Как подготовиться к <span>пентесту</span>?</h2>
              <p class="text-center text-sm mt-3">Подготовка к пентесту включает несколько этапов</p>
              <div>
                <PenttestScheme />
              </div>
            </div>
            <div>
              <h2 class="h2 !text-xl !text-left">
                В ходе пентеста, <span>осуществляется</span>:
              </h2>
              <ul class="font-inter space-y-4">
                <li v-for="(item, idx) in duringPentTest" :key="item" class="flex items-start gap-6 mt-9">
                  <BaseIcon class="text-[#916AE9] shrink-0 grow-0 w-[44px] h-[44px]" name="done-circle" />
                  <div>
                    <p v-if="idx === 5" v-html="item"></p>
                    <p v-else>{{ item }}</p>
                  </div>
                </li>
              </ul>
            </div>
            <p class="mt-6">
              <strong>Сроки (время)</strong> проведения могут варьироваться в зависимости
              <strong>от масштаба ИКИ</strong> заказчика, <strong>количества серверов (ИС)</strong> и других аспектов.
            </p>

            <h2 class="h2"><span>Пентест</span> состоит из:</h2>
            <div class="purple-grid grid-cols-3 mt-6 max-md:grid-cols-1">
              <div v-for="(item, idx) in testConsistsOf" :key="item.title" class="last:col-span-3 max-md:last:col-span-1">
                <h4>{{ item.title }}</h4>
                <div v-if="idx === 6" v-html="item.note"></div>
                <div v-else>{{ item.note }}</div>
              </div>
            </div>
            <h2 class="h2">Можно ли <span>своими силами провести пентест</span>?</h2>
            <div class="space-y-6 mt-6">
              <p>Самостоятельное проведение пентеста теоретически возможно, но требует от организации наличия квалифицированных специалистов с глубокими знаниями в области кибербезопасности и понимания сетевой инфраструктуры. Такие специалисты должны быть осведомлены о последних тенденциях и методах кибератак, а также обладать навыками работы с различными инструментами и техниками для проведения тестов. Кроме того, необходимо чётко понимать правовые и этические аспекты пентеста, чтобы избежать нарушения закона или компрометации чувствительных данных. Важно также обеспечить, чтобы процесс тестирования не нанёс вреда операционной среде или бизнес-процессам.</p>
              <p>И есть один очень важный момент: руководителю необходимо получить независимую оценку от внешних аудиторов безопасности, что считается “best practice”. Это необходимо для предотвращения внутреннего конфликта интересов и получения полной картины состояния ИБ в своей организации.</p>
              <p class="font-bold">Ответ на вопрос: да, можно, НО лучше привлечь квалифицированных специалистов для получения независимой оценки состояния защищённости.</p>
            </div>
            <ArticleAlert type="warn" title="Важно" class="mt-12">
              <p class=" text-white font-inter font-light text-sm">
                При выборе поставщика услуг по проведению тестирования на проникновение <strong>ключевым критерием</strong> является <strong>наличие официально оформленных трудовых отношений</strong> с квалифицированными специалистами, обладающими гражданством Республики Казахстан. Это требование обусловлено случаями, когда <strong>компании предъявляют сертификаты</strong> сотрудников без заключения с ними трудовых договоров, что впоследствии выявляет отсутствие необходимой квалификации у исполнителей. Учитывая, что в процессе тестирования специалисты <strong>получают доступ к чувствительной информации</strong> государственных и квазигосударственных организаций, <strong>предпочтение отдаётся гражданам Республики Казахстан</strong> для обеспечения информационной безопасности и предотвращения утечки данных.
              </p>
            </ArticleAlert>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Инструментальное обследование анализирует и тестирует отдельные части системы с помощью специализированных
            инструментов. Оно выявляет уязвимости в конкретных компонентах, обеспечивая детализированное понимание
            состояния безопасности и позволяя проводить целенаправленные улучшения.
          </p>
        </template>
      </ConclusionContainer>
    </main>
  </div>
</template>

<script setup lang="ts">
import PenttestScheme from "./_ui/penttest-scheme.vue";
import MainHeader from "~/shared/components/headers/MainHeader.vue";
import TopHeader from "~/shared/components/headers/TopHeader.vue";
import ConclusionContainer from "~/pages/methodology/_block/conclusion-container.vue";
import ArticleAlert from "~/pages/methodology/_block/article-alert.vue";
import BaseIcon from "~/shared/components/BaseIcon.vue";

const duringPentTest = [
  "Поиск общедоступной информации о заказчике с помощью поисковых систем, а также сбор и анализ информации через регистрационные базы данных (регистраторы имён и адресов, DNS, Whois и т. д.).",
  "Сбор информации о доступных из сетей общего доступа ресурсах, действующих информационных системах (сетевых сервисах, операционных системах и приложениях).",
  "Выявление уязвимостей в ИКИ заказчика, способных привести к несанкционированному воздействию на них.",
  "Разработка векторов и методов проникновения с учётом анализа полученных данных.",
  "Ручная верификация и анализ результатов инструментального сканирования, проверка соответствия конфигурации веб-приложения рекомендациям по безопасной настройке программного обеспечения (CMS, фреймворков, веб-сервера, сервера приложений и т. д.).",
  "Ручная проверка веб-приложений по методологии <a class='underline' target='_blank' href='https://ru.wikipedia.org/wiki/OWASP'>OWASP.</a>",
  "Попытки получения учетных записей и паролей пользователей и администраторов ИКИ.",
  "Тестирование на проникновение на сетевом уровне, попытки перехвата сетевого трафика в пользовательских сегментах.",
  "Попытки получения несанкционированного доступа к серверам, базам данных, РС пользователей с использованием уязвимостей программного обеспечения, сетевого оборудования, некорректных настроек и найденных учетных записей.",
  "Проведение анализа защищённости беспроводной сети.",
  "Применение статического анализатора безопасности приложений (SAST) для поиска уязвимостей и незадекларированных возможностей, включая прописанные в коде пароли.",
];

const testConsistsOf: { title: string, note: string }[] = [
  {
    title: "Планирования",
    note: "Определение целей и области тестирования. Включает в себя выбор методов и инструментов, а также согласование границ и правил тестирования с заказчиком.",
  },
  {
    title: "Сканирования, сбора информации",
    note: "Активное сканирование целевой системы или сети для сбора информации, такой как открытые порты, используемые сервисы и версии программного обеспечения.",
  },
  {
    title: "Анализа уязвимостей",
    note: "Оценка собранной информации для выявления потенциальных уязвимостей, которые могут быть эксплуатированы.",
  },
  {
    title: "Эксплуатации уязвимостей",
    note: "Попытка проникновения в систему с использованием найденных уязвимостей для оценки реального уровня угрозы.",
  },
  {
    title: "Поддержания доступа",
    note: "Проверка возможности длительного сохранения доступа к системе после успешного проникновения, что может быть важно для оценки риска постоянного присутствия злоумышленника в системе.",
  },
  {
    title: "Постанализа",
    note: "После завершения эксплуатации уязвимостей проводится анализ полученных результатов. Этот этап включает документирование найденных уязвимостей, составление перечня способов их эксплуатации и рекомендаций по устранению.",
  },
  {
    title: "Составления отчёта",
    note: `
      <ul class="list-disc ml-4">
        <li><strong>Термины и определения:</strong> Термины и сокращения, употребляемые в отчёте пентеста.</li>
        <li><strong>Общие положения:</strong> Наименование работ, указание заказчика и исполнителя, период проведения работ и цели пентеста. Вводные данные и ограничения в ходе проведения работ.</li>
        <li><strong>Результаты тестирования на проникновение:</strong> Основные результаты тестирования, обнаруженные уязвимости, общий уровень защищённости системы. Угрозы и риски, связанные с обнаруженными уязвимостями.</li>
        <li><strong>Методика тестирования защищённости:</strong> Используемые методики и инструменты для тестирования защищённости. Включает требования и рекомендации международных стандартов и руководств по ИБ.</li>
        <li><strong>Модель нарушителя:</strong> Описание модели нарушителя и его возможностей.</li>
        <li><strong>Проведение пентеста веб-приложений:</strong> Найденные уязвимости, описания и скриншоты уязвимостей.</li>
        <li><strong>Рекомендации по повышению уровня защищённости:</strong> Рекомендации по устранению выявленных уязвимостей, включая место обнаружения, описание, уровень риска и предложения по устранению. </li> 
      </ul>
      `,
  },
];
</script>

<style scoped lang="scss">
strong {
  font-weight: 700;
}
a {
  text-decoration-line: underline;
}
.h2 {
  @apply text-[25px] leading-tight font-extrabold text-center mt-10 font-inter [&>span]:text-main-purple mx-auto;
}
.purple-grid {
  @apply grid gap-6 font-inter;

  & > * {
    @apply p-5 border-2 border-main-purple;

    & > :first-child {
      @apply font-bold text-main-purple;
    }

    & > :not(:first-child) {
      @apply text-xs mt-4;
    }
  }
}
</style>
