<template>
    <div>
        <header class="flex flex-col items-start">
        <TopHeader ><p class="font-sfProDisplay text-xl text-white">Статья 9</p></TopHeader>
        <MainHeader class="" bg-color="primary">Что такое реестр доверенного</MainHeader>
        <MainHeader class="max-w-[900px]" bg-color="secondary">программного обеспечения?</MainHeader>
        <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
          <p class="font-inter text-sm">
            Реестр доверенного программного обеспечения и продукции электронной промышленности (далее – реестр) – перечень программного обеспечения и продукции электронной промышленности, соответствующих требованиям информационной безопасности (ИБ), созданный для целей обеспечения обороны страны и безопасности государства.
          </p>
        </div>
      </header>
      <main class="my-9">
        <ConclusionContainer title="ВЫВОД № 16:">
            <template #default>
                <div class="p-8 font-inter space-y-6 max-md:p-4">
                  <p>Реестр нужен для введения информации о программном обеспечении, которое было проверено и признано безопасным для использования в организации. Это помогает защитить системы от уязвимостей, вредоносных программ и других киберугроз.</p>
                  <p>Порядок включения ПО и продукции в реестр регламентируется данными <a href="https://adilet.zan.kz/rus/docs/V1800016750" target="_blank">Правилами.</a></p>
                  <ArticleAlert type="question">
                    <template #title>
                      <p class="text-lg text-white font-inter font-bold">Кто обязан приобретать продукцию из реестра?</p>
                    </template>
                  </ArticleAlert>
                  <p>Государственные органы, субъекты квазигосударственного сектора, а также владельцы и (или) собственники КВОИКИ приобретают программное обеспечение и продукцию электронной промышленности в виде товара и информационно-коммуникационной услуги.</p>
                  <p>В случае отсутствия в реестре необходимой продукции её приобретение допускается в соответствии с законодательством Республики Казахстан о государственных закупках, закупках отдельных субъектов квазигосударственного сектора. То есть, если в реестре нет того, что вам нужно, вы можете его приобрести обычным порядком.</p>
                  <p>Основным условием включения программного обеспечения (продукции) в реестр является сертификат соответствия требованиям информационной безопасности не ниже 4 уровня доверия для программного обеспечения в соответствии с СТ РК ISO/IEC 15408-3 (в актуальной версии на момент проведения сертификации) или наличие протоколов испытаний с положительными результатами <nuxt-link to="/methodology/6">(об испытаниях мы поговорили с вами в разделе 6)</nuxt-link>.</p>
                  <p>Состав реестра постоянно меняется, поэтому актуальный реестр доверенного программного обеспечения (продукции электронной промышленности) вы можете найти <a href="https://rchl.govtec.kz/ru/rdpo" target="_blank">ЗДЕСЬ</a>. Еще один вариант, но с более продвинутыми фильтрами поиска, находится <a href="https://goszakup.gov.kz/ru/it_reg" target="_blank">ЗДЕСЬ</a>.</p>
                </div>
            </template>
            <template #conclusion>
            <p class="font-inter text-black">
              Реестр доверенного ПО обеспечивает безопасность государства, включив проверенные и безопасные продукты. Государственные и квазигосударственные органы обязаны использовать ПО из реестра. При отсутствии нужного ПО в реестре, его можно приобрести через государственные закупки. Основное условие включения в реестр — сертификат соответствия требованиям ИБ. Актуальный реестр доступен онлайн и регулярно обновляется. Приобретайте проверенные продукты!
            </p>
          </template>
        </ConclusionContainer>     
      </main>    
    </div>
</template>

<script setup lang="ts">
import MainHeader from '~/shared/components/headers/MainHeader.vue';
import TopHeader from '~/shared/components/headers/TopHeader.vue';
import ConclusionContainer from '~/pages/methodology/_block/conclusion-container.vue';
import ArticleAlert from '~/pages/methodology/_block/article-alert.vue';
</script>

<style scoped>
strong {
  font-weight: 700;
}
a {
  text-decoration-line: underline;
}
</style>