<template>
  <div>
    <header class="flex flex-col items-start">
      <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 1</p></TopHeader>
      <MainHeader class="max-w-[900px]" bg-color="primary">Что такое информационная безопасность</MainHeader>
      <MainHeader class="max-w-[900px]" bg-color="secondary">и какие документы ее регулируют?</MainHeader>
      <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
        <p class="font-inter text-sm">
          Исходный термин “ИНФОРМАЦИОННАЯ БЕЗОПАСНОСТЬ” берет свое начало в Законе РК “О национальной безопасности”,
          согласно которого:
        </p>
        <p class="mt-6 font-inter italic text-sm">
          Информационная безопасность – это защита информационного пространства РК, а также защита прав и интересов
          людей, общества и государства в информационной сфере от угроз. Это гарантирует стабильное развитие и
          информационную независимость страны.
          <span class="font-bold">Далее упростим это определение для лучшего понимания.</span>
        </p>
      </div>
    </header>
    <main class="mt-9">
      <ConclusionContainer title="ВЫВОД № 1:">
        <template #default>
          <div class="p-6 bg-[#DCFF98]/30 max-md:p-4">
            <h2 class="font-inter font-semibold text-black text-[30px] leading-tight">
              Следует знать, что сфера ИБ делится на два аспекта:
            </h2>
            <div class="grid grid-cols-2 mt-6 gap-6 font-inter text-black max-md:grid-cols-1">
              <div class="py-8 px-6 bg-white/70 space-y-6">
                <h4 class="text-30 font-inter font-semibold">Социально-политический аспект ИБ</h4>
                <p class="text-xs font-inter">
                  направлен на защиту информационного пространства и средств массовой информации от целенаправленного
                  негативного воздействия. Он включает борьбу с дезинформацией, информационным манипулированием, а также
                  контроль над общественным мнением. <b>Фактчекинг</b> является одним из инструментов защиты в этом
                  аспекте.
                </p>
                <p class="text-xs font-inter font-bold">
                  Напоминание: Не передавайте друзьям или знакомым не проверенную информацию, так как она может быть не
                  достоверной.
                </p>
              </div>
              <div class="py-8 px-6 bg-white/70 space-y-6">
                <h4 class="text-30 font-inter font-semibold">Технический аспект ИБ</h4>
                <p class="text-xs font-inter">
                  связан с защитой информации от несанкционированного доступа, использования, изменения и
                  уничтожения. Его целью является обеспечение целостности, конфиденциальности и доступности информации.
                </p>
                <p class="italic text-xs font-inter">
                  Например: egov должен быть всегда доступен, а информация, которую он нам выдает достоверной.
                </p>
              </div>
            </div>
          </div>
          <div class="p-6">
            <ArticleAlert title="Напоминание:" type="warn">
              <p class="text-sm text-white font-inter font-light">
                После передачи/использования информации не забывайте уничтожать данные на бумажных и электронных носителях!
              </p>
            </ArticleAlert>
          </div>
        </template>
        <template #conclusion
          ><p class="font-inter text-black">
            Информационная безопасность состоит из двух аспектов: социально-политический и технический.
          </p></template
        >
      </ConclusionContainer>
      <ConclusionContainer title="ВЫВОД № 2:" class="mt-[75px]">
        <template #default>
          <div class="p-8 max-md:p-4">
            <div class="space-y-6 [&_*]:font-inter">
              <p>Наш портал рассматривает технический аспект информационной безопасности.</p>
              <p>
                <span class="font-bold text-base">Документы регулирующие информационную безопасность</span>.<br />
                Закон РК «Об информатизации» регулирует общественные отношения в сфере информатизации и обеспечения
                информационной безопасности, а также определяет основные понятия в данной отрасли.
              </p>
              <p>
                <span class="text-[#916AE9] font-bold">Информационная безопасность в сфере информатизации</span> — это
                состояние защищённости электронных информационных ресурсов, информационных систем и
                информационно-коммуникационной инфраструктуры от внешних и внутренних угроз. Таким образом, мы защищаем
                следующие активы:
              </p>
            </div>
            <div class="flex flex-col items-center !mt-14">
              <div class="relative">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="877"
                  height="50"
                  fill="none"
                  viewBox="0 0 877 50"
                  class="max-xl:hidden">
                  <path stroke="#916AE9" stroke-width="2" d="M326 1H8" />
                  <path
                    fill="#916AE9"
                    d="M7.293 49.707a1 1 0 0 0 1.414 0l6.364-6.364a1 1 0 0 0-1.414-1.414L8 47.586l-5.657-5.657A1 1 0 1 0 .93 43.343l6.364 6.364ZM7 0v49h2V0H7Zm246.293 49.707a1 1 0 0 0 1.414 0l6.364-6.364a1 1 0 1 0-1.414-1.414L254 47.586l-5.657-5.657a1 1 0 1 0-1.414 1.414l6.364 6.364ZM253 0v49h2V0h-2Z" />
                  <path stroke="#916AE9" stroke-width="2" d="M551 1h318" />
                  <path
                    fill="#916AE9"
                    d="M869.707 49.707a1 1 0 0 1-1.414 0l-6.364-6.364a1 1 0 1 1 1.414-1.414L869 47.586l5.657-5.657a1 1 0 1 1 1.414 1.414l-6.364 6.364ZM870 0v49h-2V0h2ZM623.707 49.707a1 1 0 0 1-1.414 0l-6.364-6.364a1 1 0 1 1 1.414-1.414L623 47.586l5.657-5.657a1 1 0 1 1 1.414 1.414l-6.364 6.364ZM624 0v49h-2V0h2Z" />
                </svg>
                <p
                  class="bg-[#916AE9] absolute left-1/2 -translate-x-1/2 font-inter font-bold text-white py-[10px] px-4 top-0 -translate-y-1/2 max-xl:relative">
                  Объект информатизации
                </p>
              </div>
              <div class="grid grid-cols-4 gap-8 max-xl:grid-cols-2 max-md:grid-cols-1">
                <div class="border-2 border-[#916AE9] p-[10px] flex flex-col items-start">
                  <BaseIcon color="#916AE9" name="methodology/image-file" />
                  <p class="text-xs font-inter mt-[10px]">
                    <b>Электронные информационные ресурсы</b> <br />
                    <span class="text-[#7F7F7F] font-light"
                      >тексты, электронные документы, изображения, видео и т. д</span
                    >
                  </p>
                </div>
                <div class="border-2 border-[#916AE9] p-[10px]">
                  <BaseIcon color="#916AE9" name="methodology/book" />
                  <p class="text-xs font-inter mt-[10px]">
                    <b>Программное обеспечение</b><br />
                    <span class="text-[#7F7F7F] font-light"
                      >(операционные системы, прикладные программы, утилиты, антивирусные программы и т. д.);</span
                    >
                  </p>
                </div>
                <div class="border-2 border-[#916AE9] p-[10px] flex flex-col items-start">
                  <BaseIcon color="#916AE9" name="methodology/group" class="self-end max-xl:self-start" />
                  <p class="text-xs font-inter mt-[10px]">
                    <b>Интернет-ресурсы</b> <br />
                    <span class="text-[#7F7F7F] font-light"
                      >(веб-сайты, блоги, социальные сети, онлайн-форумы и т. д.);</span
                    >
                  </p>
                </div>
                <div class="border-2 border-[#916AE9] p-[10px] flex flex-col items-start">
                  <BaseIcon color="#916AE9" name="methodology/group" class="self-end max-xl:self-start" />
                  <p class="text-xs font-inter mt-[10px]">
                    <b>Информационно-коммуникационная инфраструктура, </b> <br />
                    <span class="text-[#7F7F7F] font-light"
                      >включая информационные системы (каналы и сети связи, серверы, сетевое оборудование, веб-сайты,
                      автоматизированные системы управления, приложения, базы данных и др.).</span
                    >
                  </p>
                </div>
              </div>
            </div>
            <p class="text-[#333333] mt-5">
              Информационная безопасность в области информатизации также понимается как термин "кибербезопасность",
              который был впервые использован в Концепции кибербезопасности "Киберщит Казахстана" (постановление
              Правительства РК №407 от 30 июня 2017 года).
            </p>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Защищаем информацию и данные в любом виде. А информационная безопасность в сфере информатизации =
            кибербезопасность! С этим разобрались)
          </p>
        </template>
      </ConclusionContainer>
      <ConclusionContainer title="ВЫВОД № 3:" class="mt-[75px]">
        <template #default>
          <div class="p-8 max-md:p-4">
            <p class="font-bold font-inter text-[22px] leading-tight text-[#916AE9]">
              ЧТО ТАКОЕ ДАННЫЕ? Какие виды информации бывают?
            </p>
            <p class="font-inter mt-[30px] text-lg text-[#333333]">
              <span class="text-[#916AE9] font-bold">Данные </span>— это факты или сведения, которые еще не обработаны
              или не организованы. Они представляют собой статистику, текст, числа, изображения, звуки или любую другую
              форму информации.
            </p>
            <p class="font-inter mt-[30px] text-lg text-[#333333]">
              <span class="text-[#916AE9] font-bold">Информация</span>— это данные, которые были обработаны,
              организованы или проанализированы, чтобы приобрести значение или смысл. Информация более полезна, чем
              просто данные, потому что она представляет собой осмысленный контекст или выводы, которые можно
              использовать для принятия решений или действий.
            </p>
            <p class="text-sm font-inter mt-5">
              В зависимости от их природы и предназначения данные могут быть классифицированы по разным критериям. Вот
              некоторые из основных видов данных:
            </p>
            <div class="bg-[#916AE9] p-[10px] font-bold inline-block text-white mt-5">Классификация данных</div>
            <div
              class="grid grid-cols-2 gap-5 [&>div]:border-2 [&>div]:border-[#916AE9] [&>div]:p-5 [&>div]:max-md:p-3 [&_*]:font-inter mt-5 max-md:grid-cols-1">
              <div>
                <p class="text-sm font-bold">1. Коммерческие данные:</p>
                <p class="mt-[10px] text-xs">
                  Это информация, связанная с деловыми операциями компании. Коммерческие данные могут включать в себя
                  финансовые отчёты, данные о продажах, инвентаризации товаров и так далее.
                </p>
              </div>
              <div>
                <p class="text-sm font-bold">2. Служебные данные:</p>
                <p class="mt-[10px] text-xs">
                  Это данные, используемые в рабочих или офисных средах для организации работы. Они могут включать в
                  себя расписания, задачи, заметки, контактные данные коллег и прочее.
                </p>
              </div>
              <div class="col-span-2 max-md:col-span-1">
                <p class="text-sm font-bold">3. Персональные данные:</p>
                <p class="mt-[10px] text-xs">
                  Это информация, которая позволяет идентифицировать физическое лицо. Персональные данные могут быть
                  зафиксированы на электронном, бумажном и (или) ином материальном носителе. Сведения, которые не
                  определяют конкретное физическое лицо без привязки дополнительных данных (например, Ф.И.О., ИИН и т.
                  д.), не являются персональными данными.
                </p>
                <p class="mt-[10px] text-xs">
                  Персональные данные по доступности подразделяются на общедоступные и ограниченного доступа:
                </p>
                <div class="flex [&>div]:flex-1 gap-[10px] mt-4 max-md:flex-col">
                  <div>
                    <p class="text-xs">
                      <b>3.1. Общедоступные персональные данные:</b> Это персональные данные, на которые в соответствии
                      с законами Республики Казахстан не распространяются требования соблюдения конфиденциальности, и
                      доступ к которым является свободным с согласия субъекта.
                    </p>
                  </div>
                  <div>
                    <p class="text-xs">
                      <b>3.2. Персональные данные ограниченного доступа:</b> Это персональные данные, доступ к которым
                      ограничен законодательством Республики Казахстан (например, медицинская тайна, банковская тайна и
                      другие).
                    </p>
                  </div>
                </div>
              </div>
              <div>
                <p class="text-sm font-bold">4. Транзакционные данные</p>
                <p class="mt-[10px] text-xs">
                  Это данные, связанные с финансовыми транзакциями, такими как покупки, продажи, переводы и платежи.
                </p>
              </div>
              <div>
                <p class="text-sm font-bold">5. Биометрические данные</p>
                <p class="mt-[10px] text-xs">
                  Это персональные данные, которые характеризуют физиологические и биологические особенности субъекта
                  персональных данных, на основе которых можно установить его личность.
                </p>
              </div>
            </div>
            <p class="text-sm mt-5">
              Классификация данных важна для их эффективного хранения, обработки и использования, а также для
              обеспечения безопасности и конфиденциальности тех данных, которые требуют защиты, то есть персональных
              данных.
            </p>
            <ArticleAlert type="success" class="mt-5">
              <template #title>
                <p class="text-sm text-white font-inter font-light">
                  Для изучения безопасной работы с персональными данными в рамках курса по кибергигиене, <NuxtLink class="underline" to="/awareness">переходите сюда</NuxtLink>
                </p>
              </template>
            </ArticleAlert>
            <div
              class="flex [&_*]:font-inter [&>*]:w-1/2 mt-9 justify-between max-lg:flex-col [&>*]:max-xl:w-auto max-lg:gap-4">
              <p class="max-xl:max-w-[200px] shrink-0 max-lg:max-w-max">
                <b>Классическая модель кибербезопасности</b><br />
                базируется на обеспечении трех значимых для безопасности информации атрибутов: конфиденциальность,
                целостность и доступность.
              </p>
              <ul class="pl-[170px] max-md:pl-[120px] space-y-1">
                <li class="relative">
                  <img
                    src="/images/methodology/elephant.svg"
                    class="w-[144px] max-md:w-[100px] !h-auto absolute left-0 -translate-x-[calc(100%+15px)] top-1/2 -translate-y-1/2" />
                  <p class="text-2xl font-medium text-[#333333]">Целостность</p>
                  <p class="text-[#4A4A4A] text-xs font-light">
                    информации означает, что данные находятся в корректном состоянии, нужном для использования.
                    Например, базы данных защищены от внесения изменений сторонними лицами.
                  </p>
                </li>
                <li class="relative">
                  <img
                    class="absolute left-0 top-1/2 !h-auto w-[144px] -translate-x-[calc(100%+15px)] -translate-y-1/2 max-md:w-[100px]"
                    src="/images/methodology/elephant.svg" />
                  <p class="text-2xl font-medium text-[#333333]">Конфиденциальность</p>
                  <p class="text-[#4A4A4A] text-xs font-light">
                    информации гарантирует, что доступ к данным предоставляется только тем лицам, у которых есть
                    законное право на него. Например, секретные данные доступны только авторизованным лицам с
                    соответствующими правами доступа.
                  </p>
                </li>
                <li class="relative">
                  <img
                    class="absolute left-0 top-1/2 !h-auto w-[144px] -translate-x-[calc(100%+15px)] -translate-y-1/2 max-md:w-[100px]"
                    src="/images/methodology/elephant.svg" />
                  <p class="text-2xl font-medium text-[#333333]">Доступность</p>
                  <p class="text-[#4A4A4A] text-xs font-light">
                    информации обеспечивает, что данные доступны пользователям в нужное время и место. Например,
                    банковское приложение должно быть доступно 24/7/365 для клиентов.
                  </p>
                </li>
              </ul>
            </div>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Для чего нужно обеспечить кибербезопасность?<br />
            Для того чтобы вы и ваша организация были уверены в защищённости информации. Сегодня обеспечение
            кибербезопасности — это бренд любой успешной компании (организации, учреждения и др.). И да, это не разовая
            акция, а ежедневная коллективная работа.
          </p>
        </template>
      </ConclusionContainer>
      <ConclusionContainer title="ВЫВОД № 4:" class="mt-[75px]">
        <template #default>
          <div class="p-8 space-y-6 max-md:p-4">
            <ArticleAlert type="question">
              <template #title>
                <p class="text-lg text-white font-inter font-bold">
                  Кто же в нашей стране регулирует сферу кибербезопасности?
                </p>
              </template>
            </ArticleAlert>
            <p class="text-[#333333] font-inter">
              Впервые в 2016 году Указом Президента Республики Казахстан был создан Комитет по информационной
              безопасности, который на сегодняшний день входит в состав Министерства цифрового развития, инноваций и
              аэрокосмической промышленности Республики Казахстан. <br /><br />
              Комитет по информационной безопасности является уполномоченным органом в сфере кибербезопасности,
              отвечающим за реализацию государственной политики, государственного контроля, а также за развитие рынка в
              данной сфере.
              <br /><br />
              Комитет национальной безопасности Республики Казахстан осуществляет мероприятия по киберзащите информации
              через технического оператора АО “Государственная техническая служба”, на базе которого функционирует
              Национальный координационный центр информационной безопасности и Национальная служба реагирования на
              компьютерные инциденты.
            </p>
            <ArticleAlert type="info" title="Примечание:">
              <template #default>
                <p class="text-sm text-black font-inter font-light">
                  В каждой отрасли существует также свой регулятор. К примеру, финансовому сектору дополнительные
                  требования устанавливает АРРФР (Агентство Республики Казахстан по регулированию и развитию финансового
                  рынка).
                </p>
              </template>
            </ArticleAlert>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Основным уполномоченным государственным органом в области обеспечения информационной безопасности в сфере
            информатизации (кибербезопасности) является Комитет по информационной безопасности Министерства цифрового
            развития, инноваций и аэрокосмической промышленности (КИБ МЦРИАП).
          </p>
        </template>
      </ConclusionContainer>
      <ConclusionContainer title="ВЫВОД № 5:" class="mt-[75px]">
        <template #default>
          <div class="p-8 space-y-6 max-md:p-4">
            <ArticleAlert type="question">
              <template #title>
                <p class="text-lg text-white font-inter font-bold">
                  Как выглядит экосистема кибербезопасности в Казахстане?
                </p>
              </template>
            </ArticleAlert>
            <div class="w-full overflow-hidden aspect-[1.75] relative">
              <OrgChart class="w-full absolute inset-0 h-full" />
            </div>
            <div>
              <h2 class="text-[#916AE9] font-extrabold text-[25px] leading-tight">
                Основные субъекты и сокращения
              </h2>
              <p>Экосистема кибербезопасности состоит из государственных и частных субъектов, таких как:</p>
              <ul class="list-disc list-inside space-y-1 mt-2">
                <li><strong>Комитет по информационной безопасности (КИБ)</strong> — устанавливает правила игры и проверяет их исполнение.</li>
                <li><strong>Комитет национальной безопасности (КНБ)</strong> — координирует и контролирует работу АО “Государственная техническая служба”, а также проводит расследования уголовных правонарушений.</li>
                <li><strong>АО “Государственная техническая служба” (ГТС)</strong> — осуществляет функции Национального координационного центра информационной безопасности (НКЦИБ), Национальной службы реагирования на компьютерные инциденты (KZ-CERT) и другие.</li>
                <li><strong>НКЦИБ</strong> — осуществляет сбор, анализ и обобщение информации об инцидентах информационной безопасности.</li>
                <li><strong>KZ-CERT</strong> — осуществляет межотраслевую координацию по вопросам мониторинга обеспечения информационной безопасности, защиты и безопасного функционирования объектов информатизации, казахстанского Интернета.</li>
                <li><strong>Государственный ОЦИБ (ГосОЦИБ)</strong> — осуществляет мероприятия по выявлению, пресечению и исследованию угроз и инцидентов информационной безопасности государственных органов.</li>
                <li><strong>ОЦИБ</strong> — частные организации, осуществляющие деятельность по защите электронных информационных ресурсов, информационных систем, сетей телекоммуникаций и других объектов информатизации.</li>
                <li><strong>Отраслевые центры ИБ</strong> — осуществляют организацию и координацию мероприятий по обеспечению защиты информации от несанкционированного доступа или воздействия в отношении подведомственных организаций и (или) регулируемой сферы управления. <i class="block mt-2">P.S. Отраслевой центр ИБ это как НКЦИБ, только в определенной сфере. На сегодняшний день, отраслевой центр ИБ работает в финансовом секторе на базе Агентства РК по регулированию и развитию финансового рынка.</i></li>
                <li><strong>Службы реагирования на компьютерные инциденты (CERT)</strong> — частные организации, осуществляющие сбор и анализ информации об инцидентах информационной безопасности и актуальных угрозах информационной безопасности, а также предоставляют рекомендации по их устранению.</li>
                <li><strong>Исследователи ИБ (BugBounty)</strong> — исследующие объекты информатизации для выявления уязвимостей через платформы т.н. BugBounty.</li>
                <li><strong>Госорган</strong> — центральный исполнительный орган, государственный орган, непосредственно подчиненный и подотчетный Президенту Республики Казахстан, территориальные подразделения ведомства центрального исполнительного органа. <i class="block mt-2">P.S. Министерства, акиматы, агентства и территориальные департаменты.</i></li>
                <li><strong>КВОИКИ </strong>— объекты, нарушение или прекращение функционирования которых приводит к незаконному сбору конфиденциальных (защищаемых) сведений, к чрезвычайной ситуации или к значительным негативным последствиям для жизнедеятельности населения.</li>
                <li><strong>Организации</strong> — государственное юридическое лицо <i>(например, поликлиники, школы и т. д.)</i>, субъект квазигосударственного сектора <i>(например, АО “Казпочта”, АО “Казахтелеком” и т. д.)</i>, собственник и владелец частных информационных систем, интегрируемых с информационными системами государственных органов или предназначенных для формирования государственных электронных информационных ресурсов <i>(например банки)</i>, а также собственник и владелец критически важных объектов информационно-коммуникационной инфраструктуры.</li>
              </ul>
            </div>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">Теперь мы знаем, как в стране всё построено.</p>
        </template>
      </ConclusionContainer>
      <ConclusionContainer title="ВЫВОД № 6:" class="mt-[75px]">
        <template #default>
          <div class="p-8 [&_*]:font-inter space-y-6 max-md:p-4">
            <p class="text-[#916AE9] font-bold font-inter text-[22px] leading-tight max-w-[720px]">
              Государственное регулирование общественных отношений в сфере обеспечения кибербезопасности основывается на
              следующих нормативных правовых актах:
            </p>
            <ol class="list-decimal list-outside ps-6 [&_a]:underline">
              <li>
                <a href="https://adilet.zan.kz/rus/docs/K950001000_#z63" target="_blank">
                  Конституция Республики Казахстан
                </a>
                (высший нормативный правовой акт Республики Казахстан, который определяет основы политической, правовой
                и экономической систем государства).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/K1400000226#z7"
                  >Уголовный кодекс Республики Казахстан</a
                >
                (предусматривает уголовную ответственность за нарушения в сфере связи, информатизации, а также за
                нарушения в области персональных данных и их защиты).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/K1400000235#z2"
                  >Кодекс Республики Казахстан "Об административных правонарушениях"</a
                >
                (предусматривает административную ответственность за нарушения законодательства в сфере информатизации,
                связи, персональных данных и их защиты).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/Z1200000527#z1"
                  >Закон "О национальной безопасности Республики Казахстан"</a
                >
                (предназначен для защиты государства и его граждан, а также содержит различные аспекты безопасности).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/Z030000370_#z1"
                  >Закон "Об электронном документе и электронной цифровой подписи"</a
                >
                (регулирует отношения, возникающие при создании и использовании электронных документов, удостоверенных
                посредством электронных цифровых подписей).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/Z1500000418#z68">Закон "Об информатизации"</a>
                (регулирует общественные отношения в сфере информатизации).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/Z040000567_#z1">Закон "О связи"</a>
                (устанавливает правовые основы деятельности в области связи).
              </li>
              <li>
                <a target="_blank" href="https://adilet.zan.kz/rus/docs/Z1300000094#z1"
                  >Закон "О персональных данных и их защите"</a
                >
                (регулирует общественные отношения в сфере персональных данных).
              </li>
              <li>
                Постановление Правительства Республики Казахстан “Об утверждении единых требований в области ИКТ и
                обеспечения информационной безопасности” и другие законодательные акты.
              </li>
            </ol>
            <p>
              Если законы и постановления определяют, что такое информационная безопасность (ИБ), то основным
              документом, который указывает, как обеспечивать безопасность информации, являются Единые требования в
              области информационно-коммуникационных технологий и обеспечения ИБ (Единые требования).
            </p>
            <div class="gap-6">
             <!--  <p class="text-[27px] font-extrabold shrink-0">
                <span class="text-[#734CC9]">ИБ</span> регулируется
                <span class="ml-6"
                  ><svg
                    class="inline max-xl:hidden"
                    width="28"
                    height="29"
                    viewBox="0 0 28 29"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path d="M0 14L27 14" stroke="#4D4D4D" />
                    <path d="M13.5 1L27.5 14L13.5 28" stroke="#4D4D4D" stroke-linejoin="round" />
                  </svg>
                </span>
              </p> -->
              <div class="p-[30px] border border-[#916AE9] rounded-[10px]">
                <p class="font-bold text-xl text-[#734CC9]">
                  Единые требования:
                </p>
                <ul
                  class="columns-2 max-lg:columns-1 mt-3 [&>li]:text-[#6F6F6F] [&>li]:max-lg:text-base [&>li]:text-lg [&>li]:font-inter [&>li]:pl-[37px] [&>li]:relative [&>li]:before:absolute [&>li]:before:left-0 [&>li]:before:text-[42px] [&>li]:before:font-black [&>li]:before:leading-none [&>li]:before:text-[#ECECEC] [&>li]:before:top-2 max-lg:[&>li]:before:top-0 space-y-[10px] md:max-lg:space-y-5"
                >
                  <li class="before:content-['1']">
                    Определяют основные термины и определения в сфере информационных технологий (ИТ) и информационной
                    безопасности (ИБ).
                  </li>
                  <li class="before:content-['2']">
                    Регламентируют требования по информатизации госорганов
                  </li>
                  <li class="before:content-['3']">
                    Устанавливают требования к технической документации по информационной безопасности, размещению
                    рабочих станций и минимально необходимому программному обеспечению (например, антивирусное ПО, DLP и
                    другие).
                  </li>
                  <li class="before:content-['4']">
                    Определяют порядок подключения рабочих станций к интернету(Единый шлюз доступа к Интернету и т.д.).
                  </li>
                  <li class="before:content-['5']">
                    Регламентируют требования по организации ИБ (применение реестра доверенного программного обеспечения
                    и продукции электронной промышленности, оценка рисков ИБ, мониторинг ИБ, резервирование, подключение
                    к оперативным центрам ИБ и др.)
                  </li>
                  <li class="before:content-['6']">
                    Устанавливают требования к электронным информационным ресурсам, интернет-ресурсам, разрабатываемому
                    (приобретаемому) прикладному программному обеспечению, информационно-коммуникационной инфраструктуре
                    и информационным системам.
                  </li>
                </ul>
              </div>
            </div>
            <p class="text-[#333333] [&_a]:underline">
              Документ содержит <a target="_blank" href="https://adilet.zan.kz/rus/docs/P1600000832">конкретные нормы</a
              >, которым должны соответствовать организации. Общий перечень других нормативных актов и требований
              уполномоченных государственных органов по информационной безопасности также приводится в документе <a
                target="_blank"
                href="https://www.notion.so/2-e10c002743984fdc85e10f41ebf65ce0"
                >НПА по ИБ</a
              > и будет рассмотрен по мере изучения различных аспектов ИБ в данной методологии.
            </p>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            С основной нормативно-правовой базой по кибербезопасности разобрались. Теперь переходим к стандартам.
          </p>
        </template>
      </ConclusionContainer>
      <ConclusionContainer class="mt-[75px]" title="ВЫВОД № 7:">
        <template #default>
          <div class="p-8 [&_*]:font-inter max-md:p-4">
            <p>
              Как и везде, в сфере информационной безопасности (ИБ) существуют стандарты. <span class="text-nowrap">Для сведения:</span> одним из принципов <a
                class="underline"
                href="https://adilet.zan.kz/rus/docs/Z1800000183#:~:text=%D0%A1%D1%82%D0%B0%D0%BD%D0%B4%D0%B0%D1%80%D1%82%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F%20%D0%B2%20%D0%A0%D0%B5%D1%81%D0%BF%D1%83%D0%B1%D0%BB%D0%B8%D0%BA%D0%B5%20%D0%9A%D0%B0%D0%B7%D0%B0%D1%85%D1%81%D1%82%D0%B0%D0%BD%20%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D1%8B%D0%B2%D0%B0%D0%B5%D1%82%D1%81%D1%8F%20%D0%BD%D0%B0%20%D0%BF%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF%D0%B0%D1%85"
                target="_blank"
              >стандартизации</a> в РК является принцип добровольности. Это означает, что никакая организация НЕ ОБЯЗАНА соответствовать
              каким-либо стандартам, за исключением случаев, когда это прямо предписано нормативными правовыми актами.
              Тем не менее, организации могут использовать международные стандарты и практики в области информационной
              безопасности для своей выгоды, даже если это не является обязательным.
            </p>
            <p class="mt-6">
              Вот некоторые из наиболее известных на сегодня стандартов в области информационной безопасности
              (руководств, рекомендаций и др.):
            </p>
            <h3 class="text-[#4F4F4F] text-[27px] leading-tight font-extrabold mt-10 max-w-[750px]">
              В Единых требованиях (ЕТ) предусмотрены следующие стандарты:
            </h3>
            <div class="mt-16">
              <h4 class="text-[#464646] text-[35px] leading-tight font-extrabold">
                СТАНДАРТЫ В ЕТ
              </h4>
              <div class="font-inter mt-8 max-lg:grid-cols-1">
                <p>
                  Со стандартами в ЕТ можете ознакомиться
                  <NuxtLink class="text-main-purple" to="/methodology/iso-et">
                    тут
                  </NuxtLink>
                </p>
              </div>
              <h4 class="text-[#464646] text-[35px] leading-tight font-extrabold mt-14">
                МЕЖДУНАРОДНЫЕ СТАНДАРТЫ
              </h4>
              <div class="grid grid-cols-2 mt-8 gap-7 max-lg:grid-cols-1">
                <div v-for="st in dataISO" :key="st.title" class="flex items-start gap-5">
                  <img class="w-[105px] shrink-0" :src="st.image" width="105" />
                  <div class="text-[15px] !leading-tight">
                    <p class="text-[#5D5D5D] font-semibold">
                      {{ st.title }}
                    </p>
                    <p class="text-[#464646] mt-[10px]">
                      {{ st.note }}
                    </p>
                  </div>
                </div>
              </div>
            </div>
            <p class="mt-12">
              Важно прояснить основные аспекты этих четырёх стандартов в области информационной безопасности:
            </p>
            <ol class="list-decimal list-outside ps-6 [&_a]:underline">
              <li>
                ISO/IEC 27001 (и 27002 и другие): Эти стандарты признаны на международном уровне и используются в различных странах. Сертификат соответствия ISO/IEC 27001 часто требуется для участия в государственных закупках в Казахстане в сфере информационных технологий. В некоторых странах могут быть адаптированные версии этих стандартов, которые учитывают местные законодательные и культурные особенности. Например: В Казахстане действует ГОСТ Р ИСО/МЭК 27001-2016, который является национальной адаптацией международного стандарта.
              </li>
              <li>
                NIST Cybersecurity Framework: Для работы с клиентами из США важно соответствие фреймворку NIST Cybersecurity, который предоставляет методы управления и снижения рисков в области кибербезопасности.
              </li>
              <li>
                PCI DSS: Банки обязаны соответствовать стандарту PCI DSS для осуществления международных операций с платежными картами, обеспечивая защиту данных держателей карт.
              </li>
              <li>
                GDPR: Если ваша компания работает с клиентами из Европы, соблюдение регламента GDPR поможет вам приобрести дополнительные конкурентные преимущества, так как этот регламент устанавливает правила защиты персональных данных граждан ЕС, повышая доверие клиентов.
              </li>
            </ol>
            <p class="mt-6">
              Применение этих стандартов поможет значительно повысить уровень защищённости информационных ресурсов и
              инфраструктуры вашей организации, а также подчеркнёт ваше серьёзное отношение к безопасности данных перед
              инвесторами, партнёрами и клиентами.
            </p>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Стандарты по ИБ — систематизированные наборы знаний, опыта и лучших практик, применение которых способствует
            повышению эффективности вашего бизнеса.
          </p>
        </template>
      </ConclusionContainer>
      <p class="italic font-inter my-6 px-9">
        Пример: Какую машину вы выберете: ту, в которой есть стандартная система безопасности (подушки, камеры, датчики
        слепых зон и др.), или ту, в которой шанс выжить в аварии стремится к нулю? Думаем, ответ очевиден. Более
        подробно для чего нужны стандарты по ИБ и какие они бывают, можно прочитать здесь.
      </p>
    </main>
  </div>
</template>

<script setup lang="ts">
import OrgChart from "./_block/OrgChart.vue"
import MainHeader from "~/shared/components/headers/MainHeader.vue";
import TopHeader from "~/shared/components/headers/TopHeader.vue";
import ArticleAlert from "~/pages/methodology/_block/article-alert.vue";
import ConclusionContainer from "~/pages/methodology/_block/conclusion-container.vue";
import BaseIcon from "~/shared/components/BaseIcon.vue";

/* const data = ref({
  key: "0",
  label: "НКЦИБ",
  image: "/images/methodology/network_1171547.png",
  children: [
    {
      key: "0_0",
      label: "GOV-ОЦИБ",
      image: "/images/methodology/presentation_609118.png",
      children: [
        {
          key: "0_0_0",
          label: "ЦГО и МИО",
          image: "/images/methodology/Group1000000929.png",
        },
      ],
    },
    {
      key: "0_1",
      label: "Частный ОЦИБ",
      image: "/images/methodology/presentation_609118.png",
      children: [
        {
          key: "0_1_0",
          label: "Частные КВОИКИ",
          image: "/images/methodology/information_9740725.png",
        },
        {
          key: "0_1_1",
          label: "Квазигоссектор",
          image: "/images/methodology/Group1000000918.png",
        },
      ],
    },
    {
      key: "0_2",
      label: "Отраслевой ОЦИБ",
      image: "/images/methodology/presentation_609118.png",
      children: [
        {
          key: "0_2_0",
          type: "country",
          label: "Финансовые организации",
          image: "/images/methodology/bank_7881288.png",
        },
      ],
    },
  ],
}); */

const dataISO = [
  {
    title: "Серия ISO/IEC 27001, 27002",
    note: "Это международные стандарты, определяющие требования к системе управления информационной безопасностью (СУИБ), рекомендации по внедрению, поддержке и улучшению ИБ, а также меры безопасности для управления рисками ИБ в организации. Эти стандарты применяются по всему миру и являются наиболее популярными.",
    image: "/images/methodology/ISO.png",
  },
  {
    title: "NIST Cybersecurity Framework",
    note: "Фреймворк, разработанный Национальным институтом стандартов и технологий США, предоставляет методы управления и снижения рисков кибербезопасности, включая практики для повышения сопротивляемости кибератакам.",
    image: "/images/methodology/NIST.png",
  },
  {
    title: "PCI DSS",
    note: "Стандарты безопасности данных платежных карт устанавливают требования для организаций, обрабатывающих платежные данные. Они включают в себя меры безопасности для защиты информации и предотвращения кражи данных. Соблюдение PCI DSS необходимо для подключения к международным платежным системам.",
    image: "/images/methodology/PCI.png",
  },
  {
    title: "GDPR",
    note: "Общий регламент ЕС о защите данных устанавливает правила для защиты персональных данных граждан ЕС и требует от организаций принимать меры по обеспечению безопасности данных.",
    image: "/images/methodology/GDPR.png",
  },
];
</script>

<style scoped></style>
