<template>
    <div>
        <header class="flex flex-col items-start">
          <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 7</p></TopHeader>
          <MainHeader class="" bg-color="primary">Что такое аудит информационных систем,</MainHeader>
          <MainHeader class="max-w-[900px]" bg-color="secondary">кто проводит и кому нужно проходить?</MainHeader>
          <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
            <p class="font-inter text-sm">
              Согласно <a target="_blank" class="underline" href="https://adilet.zan.kz/rus/docs/V1800017141"
                >Правилам проведения аудита информационных систем</a
              >, аудит информационных систем представляет собой комплексную проверку системы безопасности организации с
              целью выявления уязвимостей, оценки рисков и предоставления рекомендаций по их устранению.
            </p>
          </div>
        </header>
        <main class="my-9">
          <ConclusionContainer title="ВЫВОД № 14:">
            <template #default>
              <div class="p-8 font-inter max-md:p-4">
                <h2 class="h2 !mt-0 max-w-[475px]">
                  К видам работ <span>по аудиту информационных систем</span> относятся:
                </h2>
                <div class="max-sm:overflow-hidden">
                  <div
                    class="grid grid-cols-[156px_repeat(3,_1fr)] max-md:grid-cols-[40px_repeat(3,_1fr)] *:p-5 max-md:*:p-2 *:border-t-2 *:border-l-2 *:border-main-purple border-main-purple border-r-2 border-b-2 mt-6 overflow-x-scroll">
                    <div class="row-start-1 font-bold max-md:text-sm max-sm:"><p class="max-md:rotate-90 max-md:translate-x-5 origin-top-left max-md:text-nowrap">Вид работ</p></div>
                    <div class="row-start-2 font-bold max-md:text-sm"><p  class="max-md:rotate-90 max-md:translate-x-5 origin-top-left max-md:text-nowrap">Описание</p></div>
                    <div class="row-start-3 font-bold max-md:text-sm"><p  class="max-md:rotate-90 max-md:translate-x-5 origin-top-left max-md:text-nowrap">Применение</p></div>
                    <div class="row-start-4 font-bold max-md:text-sm"><p  class="max-md:rotate-90 max-md:translate-x-5 origin-top-left max-md:text-nowrap">Пример</p></div>
                    <div class="font-bold text-main-purple max-md:text-sm">Проведение анализа экспертным методом</div>
                    <div class="font-bold text-main-purple max-md:text-sm">
                      Оценка соответствия рекомендациям стандартов по ИБ и единым требованиям
                    </div>
                    <div class="font-bold text-main-purple max-md:text-sm">Инструментальное обследование компонентов ИС</div>
                    <div class="text-xs row-start-2">
                      выявляются недостатки в системе мер защиты информации на основе опыта экспертов, участвующих в
                      процедуре обследования.
                    </div>
                    <div class="text-xs row-start-2">
                      проводится для определения соответствия информационной системы установленным стандартам и требованиям,
                      таким как СТ РК ИСО/МЭК 27002-2015 "Информационная технология. Методы и средства обеспечения
                      безопасности. Свод правил по средствам управления информационной безопасностью" и СТ РК ГОСТ Р
                      50739-2006 "Средства вычислительной техники. Защита от несанкционированного доступа к информации.
                      Общие технические требования".
                    </div>
                    <div class="text-xs row-start-2">
                      использование специализированных программных инструментов для автоматического сканирования и анализа
                      различных компонентов IT-инфраструктуры.
                    </div>
                    <div class="text-xs row-start-3">
                      <ul class="list-disc ml-4">
                        <li>
                          Интервью и обсуждения с сотрудниками для выявления текущих практик и потенциальных уязвимостей.
                        </li>
                        <li>Ручной анализ конфигураций систем и сетей.</li>
                        <li>
                          Обзор политики и процедур безопасности для определения соответствия лучшим практикам и стандартам.
                        </li>
                      </ul>
                    </div>
                    <div class="text-xs row-start-3">
                      <ul class="list-disc ml-4">
                        <li>Проверка документации и процессов на соответствие стандартам.</li>
                        <li>Анализ логов и журналов аудита для выявления соответствия или отклонений.</li>
                        <li>Оценка практик управления доступом, управления инцидентами и непрерывности бизнеса.</li>
                      </ul>
                    </div>
                    <div class="text-xs row-start-3">
                      <ul class="list-disc ml-4">
                        <li>
                          Уязвимость и Penetration Testing: запуск сканеров уязвимостей (например, Nessus, OpenVAS) для
                          выявления слабых мест в сети и системах.
                        </li>
                        <li>
                          Анализ конфигураций и мониторинг: использование инструментов вроде Ansible, Chef или Puppet для
                          проверки правильности конфигураций серверов и сетевого оборудования.
                        </li>
                        <li>
                          Лог-анализ и SIEM: использование систем управления информацией и событиями безопасности (например,
                          Splunk, ELK Stack) для анализа событий и выявления аномалий.
                        </li>
                      </ul>
                    </div>
                    <div class="text-xs row-start-4">
                      Эксперт изучает настройки файерволла (межсетевого экрана), сетевые политики, конфигурации серверов и
                      дает рекомендации по их улучшению на основе выявленных проблем.
                    </div>
                    <div class="text-xs row-start-4">
                      Проверка, что процедуры управления доступом соответствуют требованиям ISO/IEC 27002, включая
                      правильное использование двухфакторной аутентификации и управление паролями.
                    </div>
                    <div class="text-xs row-start-4">
                      Запуск сканера уязвимостей для проверки всех корпоративных серверов и выявления некорректных
                      конфигураций или уязвимых версий ПО, с последующим составлением отчета и рекомендаций по устранению.
                    </div>
                  </div>
                </div>
                <ArticleAlert type="question" class="mt-14">
                  <template #title>
                    <p class="text-lg text-white font-inter font-bold">Кто проводит аудит?</p>
                  </template>
                </ArticleAlert>
                <div class="p-6 space-y-6">
                  <p>
                    Проведение аудита информационных систем осуществляется физическими и (или) юридическими лицами,
                    обладающими специальными знаниями и опытом работы в области информационно-коммуникационных технологий,
                    в порядке, определяемом уполномоченным органом.
                  </p>
                  <p>
                    Для проведения аудита информационных систем мы рекомендуем обратиться в Оперативные центры
                    информационной безопасности (ОЦИБ). Подобные центры обладают высокой квалификацией, опытом и ресурсами
                    для качественного проведения аудита информационной безопасности в соответствии с действующими
                    нормативными требованиями и стандартами.
                  </p>
                </div>
                <h2 class="h2 !text-xl !text-left">Преимущества обращения в <span>ОЦИБ</span>:</h2>
                <ul class="font-inter space-y-4">
                  <li v-for="item in advantagesOCIB" :key="item.title" class="flex items-start gap-6 mt-9">
                    <svg
                      class="shrink-0 grow-0"
                      width="44"
                      height="44"
                      viewBox="0 0 44 44"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M42 22C42 25.75 40.95 29.3 39.1 32.3C35.65 38.1 29.3 42 22 42C14.7 42 8.35001 38.1 4.90001 32.3C3.05001 29.3 2 25.75 2 22C2 10.95 10.95 2 22 2C33.05 2 42 10.95 42 22Z"
                        stroke="#916AE9"
                        stroke-width="2.5"
                        stroke-miterlimit="10"
                        stroke-linecap="round"
                        stroke-linejoin="round" />
                      <path
                        d="M14.207 21.9976L19.157 26.9475L29.807 17.0977"
                        stroke="#916AE9"
                        stroke-width="2.5"
                        stroke-linecap="round"
                        stroke-linejoin="round" />
                    </svg>
                    <div>
                      <p class="font-bold text-main-purple">{{ item.title }}</p>
                      <p>{{ item.note }}</p>
                    </div>
                  </li>
                </ul>
                <h2 class="h2">Кому <span>нужно</span> проходить аудит?</h2>
                <p class="text-sm max-w-[700px] text-center mx-auto mt-3">
                  Аудит информационных систем проводится на этапе создания, внедрения и эксплуатации информационных систем
                  по инициативе собственника или владельца информационных систем.
                </p>
                <div class="purple-grid grid-cols-2 mt-6 max-md:grid-cols-1">
                    <div v-for="(item, idx) in whoNeedsAudited" :key="item.title">
                        <h4>{{ item.title }}</h4>
                        <p v-if="idx === 2" v-html="item.note"></p>
                        <p v-else>{{ item.note }}</p>
                    </div>
                </div>
                <ArticleAlert type="info" title="Мы рекомендуем" class="mt-6">
                  <p class="text-sm"><strong>Проводить аудит</strong> информационной безопасности <strong>не реже одного раза в год</strong> для оценки текущего состояния инфраструктуры и информационных систем, действий и событий, происходящих в них, определения уровня их соответствия техническим регламентам и стандартам в сфере информатизации, а также установления соответствия нормативно-технической документации всем требованиям информационной безопасности.</p>
                </ArticleAlert>
                <div>
                  <h2
                    class="text-xl font-extrabold text-center mt-12 max-w-[850px] mx-auto"
                   ><span class='bg-black text-[#E1FFA8] px-1'>Как подобрать поставщика услуг </span><br />по аудиту информационных систем?</h2>
                  <ol class="space-y-5 mt-8 font-inter">
                    <li v-for="(item, idx) in howChooseServiceProvider" :key="item.title" class="flex gap-[25px] items-start">
                      <div class="size-[50px] border-2 border-black bg-[#E1FFA8] font-extrabold text-[25px] flex items-center justify-center shrink-0 ">
                        {{ idx + 1 }}
                      </div>
                      <div>
                        <span class="bg-black font-bold text-[#E1FFA8] px-1 py-px">{{ item.title }}</span>
                        <p class="text-black mt-1">{{ item.note }}</p>
                      </div>
                    </li>
                  </ol>
                </div>
                <p class="mt-10">В рамках данного аудита важным этапом является <strong>инструментальное обследование компонентов информационных систем.</strong></p>
              </div>
            </template>
            <template #conclusion>
              <p class="font-inter text-black">
                Проведение аудита информационных систем — это не просто технический анализ, это исследование, которое
                помогает нам понять, как хорошо мы защищены от потенциальных киберугроз. Он включает анализ системы, поиск
                уязвимостей и разработку стратегий защиты. Аудит выявляет слабые места и устраняет их до того, как они
                станут проблемой, повышая общий уровень безопасности организации.
              </p>
            </template>
          </ConclusionContainer>
        </main>
    </div>
  </template>
  
  <script setup lang="ts">
  import TopHeader from '~/shared/components/headers/TopHeader.vue';
  import MainHeader from '~/shared/components/headers/MainHeader.vue';
  import ConclusionContainer from '~/pages/methodology/_block/conclusion-container.vue';
  import ArticleAlert from '~/pages/methodology/_block/article-alert.vue';
  
  const advantagesOCIB: {title: string; note: string}[] = [
    {
      title: 'Квалифицированные специалисты',
      note: 'ОЦИБ имеет в своём штате высококвалифицированных специалистов с большим опытом работы в области информационно-коммуникационных технологий и информационной безопасности.',
    },
    {
      title: 'Соответствие нормативным требованиям ',
      note: 'ОЦИБ проводит аудиты в соответствии с требованиями уполномоченного органа, что гарантирует соответствие законодательству Республики Казахстан.',
    },
    {
      title: 'Комплексный подход',
      note: 'ОЦИБ предлагает комплексные услуги по аудиту, включая оценку текущего состояния информационной безопасности, выявление уязвимостей и рекомендации по их устранению.',
    },
    {
      title: 'Использование передовых технологий',
      note: 'ОЦИБ использует современные методы и технологии для проведения аудита, что позволяет выявлять даже скрытые угрозы и уязвимости.',
    },
    {
      title: 'Конфиденциальность и надёжность',
      note: 'ОЦИБ гарантирует полную конфиденциальность и надёжность при работе с вашими данными.',
    },
  ];
  
  const whoNeedsAudited: {title: string; note: string}[] = [
    {
      title: 'Государственным органам',
      note: 'У госорганов имеется доступ к персональным данным ограниченного доступа, а также ИС или ИКИ госорганов могут быть включены в перечень КВОИКИ. По этой причине, согласно пункту 56-1 Единых требований, владелец КВОИКИ, обрабатывающий данные, содержащие охраняемую законом тайну, проводит аудит информационной безопасности не реже одного раза в год.'
    }, 
    {
      title: 'Объектам КВОИКИ',
      note: 'Согласно Закону “Об информатизации”, владелец КВОИКИ, обрабатывающий данные, содержащие охраняемую законом тайну, проводит аудит информационной безопасности не реже одного раза в год.'
    }, {
      title: 'Организациям финансового сектора',
      note: 'Аудит информационной безопасности банков второго уровня проводится в соответствии с требованиями банковского законодательства Республики Казахстан. Согласно пункту 22 <a class="underline" target="_blank" href="https://adilet.zan.kz/rus/docs/V1800016772">Требований к обеспечению информационной безопасности банков</a>, подразделение внутреннего аудита проводит оценку состояния системы управления информационной безопасностью банка в соответствии с внутренними документами банка, регламентирующими организацию системы внутреннего аудита.',
    }, 
    {
      title: 'Частным компаниям',
      note: 'В случае, если компания обрабатывает персональные данные ограниченного доступа, рекомендуется проводить аудит информационной безопасности.'
    }
  ]
  
  const howChooseServiceProvider:{title: string; note: string}[] = [
    {
      title: "Репутация и опыт",
      note: "Ищите поставщика с хорошей репутацией в области кибербезопасности. Отзывы клиентов, кейсы, публикации и рекомендации могут служить хорошим индикатором надёжности и профессионализма компании. Опыт работы в вашей отрасли также важен, поскольку это указывает на понимание специфических рисков и угроз."
    },
    {
      title: "Квалификация и сертификации",
      note: "Убедитесь, что команда поставщика включает сертифицированных специалистов с актуальными знаниями в области кибербезопасности. Наличие таких сертификаций, как OSCP (Offensive Security Certified Professional), CEH (Certified Ethical Hacker) и другие, свидетельствует о высокой квалификации исполнителей. Не стесняйтесь требовать от поставщиков предоставления трудового договора со специалистами во избежание случаев с “подставными кадрами”, а также документов, удостоверяющих их личность."
    }, 
    {
      title: "Методология тестирования",
      note: "Поставщик должен использовать чётко определённую и прозрачную методологию пентеста, соответствующую отраслевым стандартам и лучшим практикам. Спросите, какие методы и инструменты они используют и как они подходят к тестированию различных видов уязвимостей."
    },
    {
      title: "Отчётность и поддержка",
      note: "Хороший поставщик предоставляет подробные отчёты, которые включают не только перечень уязвимостей, но и рекомендации по их устранению, а также предлагает помощь в ремедиации. Отчёт должен быть понятным для разных аудиторий, от технических специалистов до управленческого состава.",
    },
    {
      title: "Конфиденциальность и безопасность",
      note: "Пентест включает работу с чувствительной информацией о вашей ИТ-инфраструктуре. Убедитесь, что поставщик серьёзно относится к конфиденциальности и имеет строгие процедуры для защиты ваших данных."
    },
    {
      title: "Соответствие нормативным требованиям",
      note: "Если ваша организация подпадает под действие специфических нормативных требований (например, ISO/IEC 27001, PCI DSS), убедитесь, что поставщик имеет опыт работы с соответствующими стандартами и может помочь вам соответствовать этим требованиям."
    },
    {
      title: "Гибкость и индивидуальный подход",
      note: "Ищите поставщика, который предлагает гибкие услуги, адаптированные под ваши конкретные нужды и цели тестирования. Возможность адаптации под специфику вашего бизнеса и технологической среды является важным фактором успешного пентеста."
    },
    {
      title: "Стоимость услуг",
      note: "Хотя стоимость является важным фактором, выбирать поставщика только на основе цены не рекомендуется. Инвестиции в качественное пентестирование могут предотвратить значительные финансовые и репутационные потери в будущем."
    }
  ]
  </script>
  
  <style scoped lang="scss">
  strong {
    font-weight: 700;
  }
  a {
    @apply underline
  }
  .h2 {
    @apply text-[25px] leading-tight font-extrabold text-center mt-10 font-inter [&>span]:text-main-purple mx-auto;
  }
  .purple-grid {
    @apply grid gap-6 font-inter;
  
    & > * {
      @apply p-5 border-2 border-main-purple;
  
      & >:first-child {
        @apply font-bold text-main-purple;
      };
  
      & >:not(:first-child) {
        @apply text-xs mt-4
      }
    }
  }
  
  </style>
  