<template>
  <div>
      <header class="flex flex-col items-start">
        <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 10</p></TopHeader>
        <MainHeader class="" bg-color="primary">Что такое оценочный уровень доверия или</MainHeader>
        <MainHeader class="max-w-[900px]" bg-color="secondary">соответствие СТ РК ISO/IEC 15408-3?</MainHeader>
        <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
          <p class="font-inter text-sm">
            Любое программное обеспечение уязвимо. Какое-то в большей, а какое-то в меньшей степени. Также программное
            обеспечение может содержать заложенные в него разработчиком программные закладки и незадекларированные
            (скрытые) возможности. Уязвимости, закладки и скрытые возможности создают предпосылки для утечки
            (разглашения) обрабатываемых конфиденциальных данных.
          </p>
        </div>
      </header>
      <main class="my-9">
        <ConclusionContainer title="ВЫВОД № 17:">
          <template #default>
            <div class="p-8 font-inter space-y-6 max-md:p-4">
              <p>
                Поэтому в сферах, связанных с обработкой конфиденциальных данных, должно применяться только то
                программное обеспечение, которое прошло определённую оценку.
              </p>
              <p>
                Если просто, то оценочный уровень доверия (ОУД) - это показатель того, насколько можно считать
                программное обеспечение безопасным.
              </p>
              <p>
                Оценка программного обеспечения осуществляется в соответствии со стандартом <a
                  target="_blank"
                  href="https://new-shop.ksm.kz/catalog/STRK_ISO_IEC_15408-3-2017/?sphrase_id=241878"
                  >ISO/IEC 15408-3-2017 "Информационные технологии. Методы и средства обеспечения безопасности. Критерии
                  оценки безопасности информационных технологий. Часть 3. Требования к обеспечению защиты"</a
                >.
              </p>
              <p>
                Истоки данного стандарта берут своё начало в США в 70-х годах прошлого века. По мере развития
                информационных технологий силовые ведомства США стремились гарантировать надёжность программного
                обеспечения, используемого госорганами для защиты информации. В результате объединения нескольких
                подходов появился стандарт ISO/IEC 15408 «Common Criteria for Information Technology Security
                Evaluation».
              </p>
              <p>
                На сегодняшний день стандартом ISO/IEC 15408-3-2017 "Информационные технологии. Методы и средства
                обеспечения безопасности. Критерии оценки безопасности информационных технологий. Часть 3. Требования к
                обеспечению защиты" предусмотрены 7 оценочных уровней доверия (далее - ОУД) к продуктам информационных
                технологий (программному обеспечению).
              </p>
              <p>
                Если кратко, то ОУД1 применяется, когда угрозы безопасности не рассматриваются как серьёзные,
                а ОУД7используется в условиях чрезвычайно высокого риска и/или там, где имеется очень высокая ценность
                информации. То есть самый низкий уровень доверия - первый (ОУД1), а самый высокий - седьмой (ОУД7).
              </p>
              <p>
                Уровни доверия подразумевают различные методы оценки от простого подтверждения наличия определённых
                функций до анализа исходного программного кода с целью выявления уязвимостей в нём.
              </p>
              <p>
                На сегодняшний день наиболее частым требованием к программному обеспечению является наличие не ниже
                четвёртого ОУД, что позволяет применять его для обработки сведений, составляющих государственные
                секреты. Наличие ОУД подтверждается сертификатом испытательной лаборатории.
              </p>
              <p>
                Для подготовки к сертификации необходимо разработать ряд документов согласно СТ РК ISO/IEC 15408,
                провести испытания исходного кода в испытательной лаборатории и направить результаты в орган по
                сертификации для выдачи решения о соответствии установленным требованиям. Анализ исходных кодов
                проводится с целью выявления недостатков ПО. Выявление недостатков ПО проводится с использованием
                специализированных программных средств на основании исходных кодов, предоставленных заявителем (вашей
                организацией). Объём работ по анализу исходного кода зависит от его размера.
              </p>
              <p>
                В РК есть ряд компаний, которые сопровождают весь путь сертификации, от подготовки необходимого пакета
                документации до выдачи сертификата соответствия.
              </p>
              <ArticleAlert type="question">
                <template #title>
                  <p class="text-lg text-white font-inter font-bold">Кто проверяет ОУД? </p>
                </template>
              </ArticleAlert>
              <p>
                ОУД проверяется лабораторией, которая была аккредитована в Национальном центре аккредитации Республики
                Казахстан на соответствие требованиям ГОСТ ISO/IEC 17065-2013 "Оценка соответствия. Требования к органам
                по сертификации продукции, процессов и услуг". Лаборатория проводит анализ и принимает решение о
                соответствии ПО установленным требованиям.
              </p>
              <p>Проверить актуальность аккредитации можете в <a target="_blank" href="https://techreg.gov.kz/index/">Реестре субъектов аккредитации.</a></p>
            </div>
          </template>
          <template #conclusion>
            <p class="font-inter text-black">
              ОУД подтверждает безопасность программного обеспечения, соответствие требованиям и стандартам, укрепляет доверие, улучшает репутацию и снижает риски для данных.
            </p>
          </template>
        </ConclusionContainer>
      </main>
  </div>
</template>

<script setup lang="ts">
import MainHeader from '~/shared/components/headers/MainHeader.vue';
import TopHeader from '~/shared/components/headers/TopHeader.vue';
import ConclusionContainer from '~/pages/methodology/_block/conclusion-container.vue';
import ArticleAlert from '~/pages/methodology/_block/article-alert.vue';
</script>

<style scoped>
strong {
  font-weight: 700;
}
a {
  text-decoration-line: underline;
}
</style>
