<template>
  <div class="container pl-sidebarWidth pt-[30px] max-md:px-4">
    <div class="rounded-xl bg-white px-11 py-[30px] text-[#3B3551] max-md:p-4">
      <h1 class="mb-6 text-lg font-bold">
        Договор оферты
      </h1>
      <div class="space-y-4">
        <p>
          Настоящее предложение Товарищества с ограниченной ответственностью ТОО «MSSP.GL» (далее - Исполнитель) в лице Генерального директора Джансенгирова Руслана Сериковича, действующего на основании Устава, является  Публичной офертой, на основании которой  Исполнитель делает предложение заключить Договор оказания услуг (далее – <i>Договор оферты/Оферта</i>), которые оказываются с применением информационных технологий, на указанных в предложении условиях с любыми заинтересованными лицами и содержит все существенные условия, которые предъявляются требованиями ст. 395-396 Гражданского кодекса Республики Казахстан к публичным офертам. Настоящая Оферта выражает волю Исполнителя заключить договор на условиях, указанных в настоящей Оферте с любым, кто отзовется.<br />
          Поэтому Заказчику необходимо внимательно прочитать текст данной Оферты и в случае несогласия с каким-либо пунктом настоящим Договором оферты, Исполнитель предлагает Заказчику отказаться от совершения каких-либо действий, необходимых для акцепта.
        </p>

        <p>1. Общие положения</p>

        <p>1.1. Настоящий «Договор-оферта» является официальным предложением Исполнителя (офертой) к заключению договора оказания информационно-консультационных услуг (далее по тексту - "Услуги") и содержит все подробные условия по условиям оказания услуг. С предлагаемыми Исполнителем Курсами (темами) и ценовыми регламентами Заказчик может ознакомиться на сайте https://citizensec.kz/ (далее по тексту - "Сайт").</p>

        <p>1.2. Акцептом "Договора-оферты" является регистрация на выбранный курс и его последующая оплата "Услуг" в порядке, размере и сроки, указанные в настоящем Договоре.</p>

        <p>1.3. Осуществляя акцепт "Договора-оферты" Заказчик гарантирует, что ознакомлен, соглашается, полностью и безоговорочно принимает все условия "Договора" в том виде, в каком они изложены в тексте «Договора-оферты».</p>

        <p>1.4. Заказчик понимает, что акцепт "Договора-оферты" равносилен заключению "Договора" на условиях, изложенных в "Договоре-оферте".</p>

        <p>1.5. Совершая действия по акцепту "Договора-оферты" Заказчик гарантирует, что он имеет законные права вступать в договорные отношения с Исполнителем.</p>

        <p>1.6. "Договор-оферта" размещается на сайте Исполнителя: https://citizensec.kz/oferta</p>

        <p>1.7. Исполнитель вправе в любое время вносить изменения в условия "Договора-оферты". Изменения в условия "Договора-оферты" начинают свое действие с момента опубликования их на "Сайте".</p>

        <p>1.8. "Договор-оферта" может быть отозван в любое время.</p>

        <p>1.9. "Договор–оферта" не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту - "Стороны"), сохраняя при этом полную юридическую силу.</p>

        <p>1.10. Информационно-консультационные услуги не являются образовательной деятельностью и не подлежат лицензированию.</p>

        <h2>2. Предмет договора оферты</h2>
        <p>2.1. В соответствии с условиями Договора Исполнитель обязуется оказать Услуги, а Заказчик обязуется оплатить Услуги Исполнителя в соответствии с условиями Договора.</p>

        <p>2.2. Виды и наименование курсов, форма реализации, срок оказания Услуг и иные необходимые характеристики, а также их стоимость указываются на соответствующих страницах курсов консультаций, опубликованных в открытом доступе на сайте Исполнителя по адресу: https://citizensec.kz/oferta. Заказчик обязуется выбрать необходимую(ые) курс(ы) в соответствии с предлагаемыми Исполнителем курсами и ценовыми регламентами Исполнителя, указанными на сайте.</p>

        <p>2.3. Исполнитель не устанавливает никаких требований и правил приема Заказчика на обучение.</p>

        <p>2.4. После оказания Услуг Исполнитель выдает Заказчику Сертификат о прохождении обучения (при условии, что курс пройден и все тесты сданы на 100%), подтверждающий оказание Услуг Исполнителем.</p>

        <p>2.5. Для оказания услуг Исполнитель вправе привлекать соисполнителей по своему выбору.</p>

        <p>2.6. Услуги могут оказываться следующими способами:</p>

        <ul>
          <li>в виде онлайн видеоуроков и текстовых уроков посредством сервисов сайта,</li>
          <li>путем предоставления доступа к видеоурокам.</li>
        </ul>

        <p>2.7. Информация и иные материалы, в том числе на бумажных, оптических и электронных носителях, аудио и видеозаписи, предоставленные Заказчику Исполнителем в рамках оказания услуг по настоящему договору, являются конфиденциальной информацией, предназначенной исключительно для Заказчика</p>

        <h2>3. Сроки: акцепта, оказания услуг, действия договора</h2>

        <p>3.1. Срок для совершения акцепта Заказчиком (оплаты услуг) составляет не менее чем 3 (три) рабочих дней до начала выбранного Заказчиком курса. Срок для совершения акцепта считается соблюденным, в случае если Исполнитель получил акцепт в пределах вышеуказанного срока.</p>

        <p>3.2. Договор вступает в силу с момента поступления денежных средств на счет Исполнителя и действует до истечения сроков доступа к Курсу(ам).</p>

        <p>3.3. Сроки оказания, конкретные время, количество часов и даты оказания Услуг указываются на Сайте в разделе(ах), соответствующем(их) выбранным(и) Заказчиком курсов(ами) Исполнителя.</p>

        <h2>4. Права и обязанности сторон</h2>

        <p>4.1. "Заказчик" обязуется:</p>

        <p>4.1.1. Выбрать необходимые курсы Исполнителя и оплатить Услуги в порядке, размере и сроки, предусмотренные настоящим Договором.</p>

        <p>4.1.2. Своевременно выполнять все задания онлайн – курса и сдавать тесты Курса.</p>

        <p>4.1.3. Своевременно передать все необходимые для оказания услуг документы и информацию Исполнителю.</p>

        <p>4.1.4. Не использовать информацию, полученную от Исполнителя в своих корыстных целях, способную нанести ущерб или испортить репутацию Исполнителя.</p>

        <p>4.1.5. Заказчик предоставляет Исполнителю (посредством заполнения заявки на Сайте) необходимые документы для формирования счета на оплату, сертификата и других необходимых документов, в том числе персональные данные включая, но не ограничиваясь: фамилию, имя, год, месяц, дату рождения, номер телефона, адрес электронной почты. В связи с этим Заказчик соглашается и предоставляет Исполнителю полное и безоговорочное согласие на использование его персональных данных, а также на их передачу третьим лицам в целях оказания Услуг, в том числе: сбор, обработку, запись, систематизация, накопление, хранение, копирование, использование, передача (предоставление). Указанные персональные данные предоставляются Заказчиком и могут быть использованы Исполнителем в период действия Договора оферты и (или) до окончания действия обязательств Сторон в целях исполнения настоящего договора на оказание услуг, передачи персональных данных Заказчика в суды, в том числе участникам судебных слушаний, органам государственной власти и правоохранительным органам по запросам таких органов. Одновременно с вышеуказанным согласием на обработку персональных данных Заказчик также дают свое полное согласие на получение сообщений от Исполнителя посредством электронной почты и смс-сообщений, в том числе сообщений рекламного содержания, касающихся услуг Исполнителя. </p>
        <p>4.1.6. самостоятельно отслеживать сроки начала оказания Услуг обучения, осваивать программу онлайн-курса в полном объеме в соответствии с программой, в том числе выполнять установленные объемы учебной нагрузки и самостоятельной работы, установленные Исполнителем;</p>
        <p>4.1.7. не разглашать конфиденциальную информацию и иные данные, предоставленные Исполнителем в связи с исполнением настоящей Оферты, не раскрывать и не разглашать такие факты или информацию (кроме информации общедоступного характера) в том числе материалы Занятия какой-либо третьей стороне без предварительного письменного согласия Исполнителя.</p>
        <p>4.1.8. не передавать полученный при Регистрации логин и пароль третьим лицам;</p>
        <p>4.1.9. не осуществлять действий, направленных на получение доступа к чужой учетной записи, путем подбора логина и пароля, взлома или иных действий;</p>
        <p>4.1.10. подписать Акт выполненных работ (оказанных услуг) в срок не позднее 5 (пяти) календарных дней с момента его получения.</p>

        <p>4.2. "Исполнитель" обязуется:</p>
        <p>4.2.1. Организовать и обеспечить надлежащее оказание Услуг в соответствии с выбранным(ой) Заказчиком курсом и "Договором-офертой".</p>
        <p>4.2.2. предоставить Заказчику доступ к https://citizensec.kz/ посредством передачи Заказчику Учетной записи на электронный адрес Заказчика при условии полной оплаты за обучение согласно выбранного Курса.</p>
        <p>4.2.3.  предоставить сертификат об окончании обучения;</p>
        <p>4.2.4. в срок не позднее 5 (пяти) рабочих дней с момента завершения оказания услуг, направить Заказчику для подписания Акт выполненных работ (оказанных услуг).</p>
        <p>4.2.5. Обеспечивать Заказчика:</p>
        <ul><li>Необходимыми информационными материалами в рамках Курса(ов).</li></ul>
        <p>4.2.6. Использовать все личные данные о Заказчике, указанные им в порядке п.4.1.5 Оферты, только для оказания Услуг, не передавать их третьим лицам.</p>

        <p>4.3. "Заказчик" вправе:</p>
        <p>4.3.1. Требовать надлежащего и своевременного оказания Услуг Исполнителем.</p>
        <p>4.3.2. Отказаться от исполнения Договора при условии оплаты Исполнителю фактически осуществленных последним расходов на оказание Услуг.</p>

        <p>4.4. "Исполнитель" вправе:</p>
        <p>4.4.1. Самостоятельно определять формы и методы оказания Услуг, прописывая условия на Сайте.</p>
        <p>4.4.2. Самостоятельно определять систему оценок при оказании Услуг, формы и порядок оценки.</p>
        <p>4.4.3. Самостоятельно определять состав специалистов, оказывающих Услуги, и по своему усмотрению распределять между ними работу.</p>
        <p>4.4.4. Требовать оплаты за оказанные или оказываемые Услуги.</p>
        <p>4.4.5. временно или полностью приостановить оказание Услуг, в случае невыполнения/нарушения Заказчиком правил обучения, без возврата произведенной Заказчиком оплаты (предоплаты).</p>
        <p>4.4.6. Получать от Заказчика любую информацию, необходимую для выполнения своих обязательств по "Договору-оферте". В случае непредставления либо неполного или неверного представления Исполнителем информации Исполнитель вправе приостановить исполнение своих обязательств по "Договору-оферте" до представления необходимой информации.</p>

        <h2>5. Порядок сдачи-приема услуг</h2>

        <p>5.1. В течение 5 (пяти) рабочих дней со дня окончания оказания Услуг Исполнитель обязан предоставить Заказчику Акт выполненных работ (оказанных услуг) и Сертификат установленного Исполнителем образца о прохождении консультационных услуг, подтверждающий оказание Услуг Исполнителем.</p>

        <p>5.2. Документы, указанные в п. 5.1 "Договора-оферты" Исполнитель отправляет Заказчику по почте или по электронной почте по своему выбору. В случае дистанционного оказания услуг, онлайн-трансляции или предоставления доступа к видеозаписям документы высылаются только посредством электронной почты.</p>

        <p>5.3. Услуги считаются оказанными Исполнителем надлежащим образом в случае передачи Исполнителем всех документов, указанных в п. 5.1 "Договора-оферты".</p>

        <p>5.4. Услуги считаются оказанными надлежащим образом и в полном объеме, если в течение трех рабочих дней с момента окончания оказания услуг Заказчиком не выставлена рекламация. В случае отсутствия рекламации услуги оказанными надлежащим образом.</p>

        <!-- TODO: skip 6 ? -->

        <h2>7. Стоимость услуг</h2>
        <p>7.1. Общая стоимость Услуг рассчитывается из стоимости выбранных Заказчиком курсов (тем) консультаций в соответствии с их стоимостью, указанной на Сайте Исполнителя.</p>
        <p>7.2. Общая стоимость Услуг может быть изменена только путем подписания дополнительного соглашения к Договору.</p>
        <p>7.3. Исполнитель имеет право устанавливать по своему усмотрению скидки, бонусы и/или предлагать любые поощрительные программы, условия которых Исполнитель публикует на сайте.</p>

        <h2>8. Порядок расчетов</h2>

        <p>8.1. Оплата Услуг по Договору осуществляется в порядке 100 (сто)-процентной предоплаты в срок до 3 (трех) календарных дней до даты начала оказания Услуг в соответствии с выбранным курсом (темой) консультаций.</p>

        <p>8.2. Способы оплаты по Договору:</p>

        <ul>
          <li>Оплата наличными средствами в офисе компании по адресу: г.Астана ул.Косшыгулулы 11/4 вп1;</li>
          <li>Пополнение кредитной карты Kaspi Gold;</li>
          <li>Перечисление Заказчиком денежных средств в валюте Республики Казахстан (тенге) на расчетный счет Исполнителя. При этом обязанности Заказчика в части оплаты по Договору считаются исполненными со дня зачисления денежных средств на расчетный счет Исполнителя.</li>
        </ul>

        <p>8.3. Возврат денежных средств Исполнителем осуществляется в течение 5 (пяти) рабочих дней на основании оригинала Заявления на возврат на счет, указанный в заявлении на возврат. Оригинал заявления на возврат должен быть передан Исполнителю лично, либо заказным почтовым отправлением с уведомлением о вручении.</p>

        <h2>9. Ответственность сторон</h2>

        <p>9.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств по Договору в соответствии с Договором и законодательством Казахстана.</p>

        <p>9.2. Неустойка по Договору выплачивается только на основании обоснованного письменного требования Сторон.</p>

        <p>9.3. Выплата неустойки не освобождает Стороны от выполнения обязанностей, предусмотренных Договором.</p>

        <p>9.4. Заказчику запрещается производить фото-, аудио- и видеосъемку онлайн – курса и материалов, связанных с прохождение курса, и в дальнейшем их распространять. В случае, если Заказчик допустит распространение указанной информации, он несет ответственность перед Исполнителем за причиненные фактом распространения информации убытки, включая недополученную прибыль и Исполнитель вправе взыскать штраф в 100-кратном размере от стоимости, оказываемых услуг, указанной в выставленном Заказчику счете, а также требовать возмещения убытков Исполнителя.</p>
        <p>9.5. При нарушении Заказчиком обязательств, предусмотренных подпунктами 4.1.7., 4.1.8.  и 4.1.9, пункта 9.4. и выявлении Исполнителем факта доступа третьих лиц к содержанию Курсов Заказчик обязан во внесудебном порядке по письменному требованию Исполнителя в течении 3 (трех) рабочих дней оплатить штраф в 100-кратном размере от стоимости, оказываемых услуг, указанной в выставленном Заказчику счете, а также требовать возмещения убытков Исполнителя.</p>

        <h2>10. Основания и порядок расторжения договора</h2>

        <p>10.1. Договор может быть расторгнут по соглашению сторон, а также по инициативе любой из Сторон в случае нарушения одной из Стороной условий Договора с письменным уведомлением другой Стороны.</p>

        <p>10.2. По факту нарушения инициативная Сторона в письменном виде подает подробный отчет с перечнем оснований для расторжения Договора.</p>

        <p>10.3. Договор считается расторгнутым с момента получения Стороной, которая нарушила условия Договора, соответствующего письменного уведомления от другой Стороны.</p>

        <h2>11. Разрешение споров из договора</h2>

        <p>11.1. Претензионный порядок досудебного урегулирования споров из Договора является для Сторон обязательным.</p>

        <p>11.2. Претензионные письма направляются "Сторонами" нарочно либо заказным почтовым отправлением с уведомлением о вручении последнего адресату по местонахождению "Сторон".</p>

        <p>11.3. Направление Сторонами претензионных писем иным способом, чем указано в п. 11.2 Договора не допускается.</p>

        <p>11.4. Срок рассмотрения претензионного письма составляет 5 (пять) рабочих дней со дня получения последнего адресатом.</p>

        <p>11.5. Споры из Договора разрешаются в судебном порядке в соответствии с законодательством Республики Казахстан по месту нахождения Исполнителя.</p>

        <h2>12. Форс-мажор</h2>

        <p>12.1. Стороны освобождаются от ответственности за полное или частичное неисполнение обязательств по Договору в случае, если неисполнение обязательств явилось следствием действий непреодолимой силы, а именно: пожара, наводнения, землетрясения, забастовки, войны, действий органов государственной власти или других независящих от Сторон обстоятельств.</p>

        <p>12.2. Сторона, которая не может выполнить обязательства по Договору, должна своевременно, но не позднее 5 (пяти) календарных дней после наступления обстоятельств непреодолимой силы, письменно известить другую Сторону, с предоставлением обосновывающих документов, выданных компетентными органами.</p>

        <h2>13. Прочие условия</h2>

        <p>13.1. Стороны признают, что если какое-либо из положений Договора становится недействительным в течение срока его действия вследствие изменения законодательства, остальные положения Договора обязательны для Сторон в течение срока действия Договора.</p>

        <h2>14. Реквизиты Исполнителя и контактная информация</h2>

        <ul class="!list-none">
          <li><strong>Товарищество с ограниченной ответственностью “MSSP.GL”</strong></li>
          <li><strong>БИН:</strong> 150140024604</li>
          <li><strong>Адрес:</strong> 010000, Республика Казахстан, город Астана, район Алматы, Проспект БАУЫРЖАН МОМЫШҰЛЫ, здание 2/1</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
useHead({
  title: "Citizensec - Договор оферты",
});
</script>

<style scoped>
h2 {
  @apply text-base font-bold !mt-6;
}
ul {
  @apply list-disc list-inside;
}
ol {
  @apply list-decimal list-outside pl-5;
}
</style>
