<template>
  <div class="container pl-sidebarWidth pt-[30px] max-md:px-4">
    <div class="rounded-xl bg-white px-11 py-[30px] text-[#3B3551] max-md:p-4">
      <h1 class="mb-6 text-lg font-bold">
        Условия предоставления услуг для CitizenSec.kz
      </h1>
      <div class="space-y-4">
        <p>1. Общие положения</p>

        <ul>
          <li>1.1. Настоящие Условия предоставления услуг (далее – Условия) регулируют порядок предоставления услуг на сайте CitizenSec.kz (далее – Сайт).</li>
          <li>1.2. Использование услуг Сайта означает полное и безоговорочное принятие Пользователем данных Условий.</li>
        </ul>

        <p>2. Описание услуг</p>

        <ul>
          <li>2.1. CitizenSec.kz предоставляет пользователям следующие услуги: [перечень услуг].</li>
          <li>2.2. CitizenSec.kz оставляет за собой право изменять перечень предоставляемых услуг, добавлять новые услуги или прекращать предоставление существующих услуг без предварительного уведомления пользователей.</li>
        </ul>

        <p>3. Регистрация и учетная запись</p>

        <ul>
          <li>3.1. Для получения доступа к определенным услугам Сайта пользователь должен зарегистрироваться, создав учетную запись.</li>
          <li>3.2. При регистрации пользователь обязуется предоставить точную и актуальную информацию.</li>
          <li>3.3. Пользователь несет ответственность за безопасность своего пароля и учетной записи. CitizenSec.kz не несет ответственности за ущерб, причиненный несанкционированным использованием учетной записи пользователя.</li>
        </ul>

        <p>4. Права и обязанности сторон</p>

        <ul>
          <li>4.1. Пользователь имеет право использовать услуги Сайта в соответствии с настоящими Условиями и законодательством Республики Казахстан.</li>
          <li>4.2. Пользователь обязуется:
            <ul>
              <li>Не использовать услуги Сайта в незаконных целях;</li>
              <li>Не нарушать права и законные интересы других пользователей и третьих лиц;</li>
              <li>Не предпринимать действий, направленных на дестабилизацию работы Сайта.</li>
            </ul>
          </li>
        </ul>

        <p>4.3. CitizenSec.kz обязуется предоставлять услуги в соответствии с настоящими Условиями и законодательством Республики Казахстан.</p>

        <p>5. Оплата услуг</p>

        <ul>
          <li>5.1. Услуги, предоставляемые на Сайте, могут быть платными. Информация о стоимости услуг размещается на соответствующих страницах Сайта.</li>
          <li>5.2. Оплата услуг осуществляется в порядке и на условиях, указанных на Сайте.</li>
        </ul>

        <p>6. Ограничение ответственности</p>

        <ul>
          <li>6.1. CitizenSec.kz не несет ответственности за любые убытки, понесенные пользователем в результате использования услуг Сайта.</li>
          <li>6.2. CitizenSec.kz не гарантирует бесперебойную и безошибочную работу Сайта и услуг.</li>
        </ul>

        <p>7. Конфиденциальность</p>

        <p>7.1. Все персональные данные, предоставленные пользователем при использовании Сайта, обрабатываются в соответствии с Политикой конфиденциальности.</p>

        <p>8. Изменение условий</p>

        <ul>
          <li>8.1. CitizenSec.kz оставляет за собой право изменять настоящие Условия в любое время без предварительного уведомления пользователей.</li>
          <li>8.2. Изменения вступают в силу с момента их публикации на Сайте. Продолжение использования услуг Сайта после внесения изменений означает согласие пользователя с новыми условиями.</li>
        </ul>

        <p>9. Заключительные положения</p>

        <ul>
          <li>9.1. Настоящие Условия являются публичной офертой.</li>
          <li>9.2. В случае возникновения вопросов или предложений по предоставлению услуг, пользователь может связаться с администрацией по контактным данным, указанным на Сайте.</li>
        </ul>

        <p>Дата последнего обновления: 28.06.2024</p>

        <p class="text-center">CitizenSec.kz, 2024</p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
useSeoMeta({
  title: "Условия предоставления услуг | CitizenSec.kz",
});
</script>
