<template>
  <div class="pt-[30px] overflow-hidden relative font-inter">
    <NuxtLayout name="methodology-articles">
      <h1 class="font-extrabold text-4xl text-[#464646]">
        СТАНДАРТЫ В ЕТ
      </h1>
      <div class="grid grid-cols-3 max-lg:grid-cols-2 max-md:grid-cols-1 gap-[30px] mt-9">
        <div v-for="item in dataGrid" :key="item.title">
          <h3 class="text-main-purple font-semibold">
            {{ item.title }}
          </h3>
          <p class="mt-[10px] text-sm text-[#464646]">
            <strong v-if="item.strong">{{ item.strong }}</strong>{{ item.note }}
          </p>
        </div>
      </div>
      <h3 class="text-main-purple font-semibold mt-9">
        СТ РК 2190-2012
      </h3>
      <ul class="text-[#464646] *:text-sm [&_span]:text-main-purple mt-[10px]">
        <li><strong>«Информационные технологии. Интернет-ресурсы государственных органов и организаций. Требования»,</strong></li>
        <li><span>СТ РК 2191-2012</span> <strong>«Информационные технологии. Доступность интернет-ресурса для людей с ограниченными возможностями»,</strong></li>
        <li><span>СТ РК 2192-2012</span> <strong>«Информационные технологии. Интернет-ресурс, интернет-портал, интранет-портал. Общие описания»</strong>,</li>
        <li><span>СТ РК 2193-2012</span> <strong>«Информационные технологии. Рекомендуемая практика разработки мобильных веб-приложений»</strong>,</li>
        <li><span>СТ РК 2199-2012</span> <strong>«Информационные технологии. Требования к безопасности веб-приложений в государственных органах»</strong> — создание или развитие интернет-ресурсов осуществляется с учетом требований этих стандартов.</li>
      </ul>
      <h3 class="font-semibold mt-9">
        При построении и эксплуатации системы заземления необходимо руководствоваться:
      </h3>
      <div class="grid grid-cols-3 max-lg:grid-cols-2 max-md:grid-cols-1 gap-[30px] mt-3">
        <div v-for="item in secondDataGrid" :key="item.title">
          <h3 class="text-main-purple font-semibold">
            {{ item.title }}
          </h3>
          <p class="mt-[10px] text-sm text-[#464646]">
            <strong v-if="item.strong">{{ item.strong }}</strong>{{ item.note }}
          </p>
        </div>
      </div>
    </NuxtLayout>
  </div>
</template>

<script setup lang="ts">
const dataGrid = [
  {
    title: "ISO/IEC 27001",
    note: "предназначен для систем управления информационной безопасностью (СУИБ). Он представляет собой руководство по созданию, внедрению, поддержанию и постоянному совершенствованию систем управления информационной безопасностью.",
  },
  {
    title: "СТ РК ISO/IEC 27002-2023",
    note: "при организации, обеспечении и управлении ИБ в государственных органах (ГО), местных исполнительных органах (МИО) или организациях необходимо руководствоваться положениями этого стандарта.",
    strong: "«Информационная безопасность, кибербезопасность и защита конфиденциальности. Средства управления информационной безопасностью» — ",
  },
  {
    title: "СТ РК 31010-2020",
    note: "выбор методики оценки рисков в соответствии с рекомендациями этого стандарта и разработка процедуры анализа рисков.",
    strong: "«Менеджмент риска. Методы оценки риска» — ",
  },
  {
    title: "СТ РК ISO/IEC 27005-2022",
    note: "формирование каталога угроз (рисков) ИБ, включающего оценку (переоценку) идентифицированных рисков в соответствии с требованиями этого стандарта.",
    strong: "«Информационные технологии. Методы обеспечения безопасности. Менеджмент риска информационной безопасности» — ",
  },
  {
    title: "СТ РК ISO/IEC 15408-2017",
    note: "при инициировании создания или развития объектов информатизации первого и второго классов, а также конфиденциальных информационных систем (ИС) разрабатываются профили защиты для составных компонентов и задание по безопасности в соответствии с требованиями этого стандарта.",
    strong: "«Информационные технологии. Методы и средства обеспечения безопасности. Критерии оценки безопасности информационных технологий» — ",
  },
  {
    title: "СТ РК 1073-2007",
    note: "для защиты служебной информации ограниченного распространения, конфиденциальных ИС, конфиденциальных электронных информационных ресурсов (ЭИР) и ЭИР, содержащих персональные данные ограниченного доступа, применяются СКЗИ (программные или аппаратные) с параметрами, соответствующими требованиям к СКЗИ.",
    strong: "«Средства криптографической защиты информации. Общие технические требования» — ",
  },
  {
    title: "СТ РК ИСО/МЭК 14888-1-2006 и СТ РК ИСО/МЭК 14888-3-2006",
    note: " и ГОСТ Р ИСО/МЭК 9594-8-98 — регистрационные свидетельства Корневого удостоверяющего центра Республики Казахстан подлежат признанию в доверенных списках программных продуктов мировых производителей ПО для целей аутентификации.",
    strong: "«Информационная технология. Методы защиты информации. Цифровые подписи с приложением»",
  },
  {
    title: "СТ РК ГОСТ Р 50739-2006",
    note: "на этапе разработки ПО учитываются рекомендации этого стандарта.",
    strong: "«Средства вычислительной техники. Защита от несанкционированного доступа к информации. Общие технические требования» — ",
  },
  {
    title: "СТ РК 34.015-2002",
    note: "требования к создаваемому или развиваемому прикладному ПО ИС определяются в техническом задании, создаваемом в соответствии с требованиями этого стандарта.",
    strong: "«Информационная технология. Комплекс стандартов на автоматизированные системы» — ",
  },
];

const secondDataGrid = [
  {
    title: "Правилами устройства электроустановок",
    note: "утвержденными приказом уполномоченного органа в сфере энергетики в соответствии с подпунктом 19) статьи 5 Закона об электроэнергетике;",
  },
  {
    title: "СТ РК МЭК 60364-5-548-96",
    note: "Раздел 548 «Заземление устройства и системы уравнивания электрических потенциалов в электроустановках, содержащих оборудование обработки информации»;",
    strong: "«Электроустановки зданий. Часть 5. Выбор и монтаж электрооборудования». ",
  },
  {
    title: "СТ РК МЭК 60364-7-707-84",
    note: "Раздел 707 «Заземление оборудования обработки информации»;",
    strong: "«Электроустановки зданий. Часть 7. Требования к специальным электроустановкам». ",
  },
  {
    title: "СТ РК ГОСТ 12.1.030-81",
    note: "«ССБТ. Электробезопасность. Защитное заземление, зануление»;",
  },
  {
    title: "СТ РК ГОСТ 464-79",
    note: "",
    strong: "«Заземление для стационарных установок проводной связи, радиорелейных станций, радиотрансляционных узлов проводного вещания и антенн систем коллективного приема телевидения. Нормы сопротивления».",
  },
];
</script>

<style scoped>
</style>
