<template>
  <div>
    <header class="flex flex-col items-start">
      <TopHeader><p class="font-sfProDisplay text-xl text-white">Статья 4</p></TopHeader>
      <MainHeader class="max-w-[900px]" bg-color="primary">Чем занимается</MainHeader>
      <MainHeader class="max-w-[900px]" bg-color="secondary">подразделение по ИБ?</MainHeader>
      <div class="bg-black pl-[18px] pr-[34px] py-[14px] text-white max-w-[650px]">
        <p class="font-inter text-sm ">
          Согласно ЕТ, в целях разграничения ответственности и функций в сфере обеспечения информационной безопасности (ИБ) создаётся подразделение ИБ, являющееся структурным подразделением, обособленным от других структурных подразделений, занимающихся вопросами создания, сопровождения и развития объектов информатизации, или определяется должностное лицо, ответственное за обеспечение ИБ.
        </p>
      </div>
    </header>
    <main class="my-9">
      <ConclusionContainer title="ВЫВОД № 11:">
        <template #default>
          <div class="p-8 *:font-inter max-md:p-4">
            <p>Подразделение ИБ или должностное лицо, ответственное за обеспечение ИБ, осуществляют координацию работ по обеспечению ИБ и контроль за исполнением требований ИБ, определённых в ТД по ИБ, а также осуществляют:</p>
            <ol class="list-decimal list-inside">
              <li>контроль исполнения требований ТД ИБ;</li>
              <li>контроль за документальным оформлением ИБ;</li>
              <li>контроль за управлением активами в части обеспечения ИБ;</li>
              <li>контроль правомерности использования ПО;</li>
              <li>контроль за управлением рисками в сфере ИКТ;</li>
              <li>контроль за регистрацией событий ИБ;</li>
              <li>проведение внутреннего аудита ИБ;</li>
              <li>контроль за организацией внешнего аудита ИБ;</li>
              <li>контроль за обеспечением непрерывности бизнес-процессов, использующих ИКТ;</li>
              <li>контроль соблюдения требований ИБ при управлении персоналом;</li>
              <li>контроль за состоянием ИБ объекта информатизации "электронного правительства".</li>
            </ol>
            <ArticleAlert type="info" title="Примечание:" class="mt-[38px]">
              <template #default>
                <p class="text-sm text-black font-inter font-light">
                  Сотрудники, ответственные за обеспечение ИБ, проходят специализированные курсы в сфере обеспечения ИБ <strong>не реже одного раза в три года</strong> с выдачей сертификата.
                </p>
              </template>
            </ArticleAlert>
            <p class="mt-[38px]">
              Как мы рассказали, согласно ЕТ в ИКТ в вашей организации должно быть подразделение ИБ. Какой-либо унифицированной (единой) организационно-штатной структуры подразделения ИБ в РК не существует.
            </p>
            <p class="mt-6">
              Но, чтобы у вас было примерное понимание состава необходимой команды, скажем, что <strong>вам понадобятся следующие специалисты:</strong>
            </p>
            <div class="grid grid-cols-2 gap-[25px] mt-6 *:border-2 *:border-main-purple *:p-5 max-md:grid-cols-1">
              <div>
                <p class="font-bold text-main-purple">Руководитель подразделения ИБ:</p>
                <p class="text-xs mt-5">Отвечает за общее управление и координацию деятельности подразделения. Этот специалист разрабатывает стратегические планы безопасности, утверждает политики и процедуры, контролирует выполнение задач, а также обеспечивает связь с высшим руководством организации.</p>
              </div>
              <div>
                <p class="font-bold text-main-purple">Администратор ИБ:</p>
                <p class="text-xs mt-5">Отвечает за настройку, управление и обслуживание систем безопасности, таких как межсетевые экраны, системы обнаружения вторжений, системы аутентификации и другие. Администратор ИБ также следит за обновлениями программного обеспечения и конфигурацией оборудования.</p>
              </div>
              <div>
                <p class="font-bold text-main-purple">Аналитик ИБ:</p>
                <p class="text-xs mt-5">Занимается мониторингом событий безопасности, анализирует данные о нарушениях и инцидентах, разрабатывает рекомендации по предотвращению будущих атак и улучшению систем безопасности. Аналитик ИБ также проводит оценку уязвимостей и рисков, анализирует текущие угрозы и тренды в области кибербезопасности.</p>
              </div>
              <div>
                <p class="font-bold text-main-purple">Оператор ИБ:</p>
                <p class="text-xs mt-5">Ответственен за оперативное реагирование на инциденты безопасности, контроль доступа к информации, обработку запросов на доступ и мониторинг безопасности. Оператор ИБ также выполняет задачи по регистрации инцидентов, а также проводит инструктаж персонала по вопросам безопасности информации.</p>
              </div>
            </div>
            <p class="mt-6">Количество специалистов на каждой позиции зависит от количества защищаемых объектов (рабочих станций, серверов, информационных систем и др.) и специфики деятельности организации. В отдельных случаях, когда организация совсем маленькая, некоторые позиции могут совмещаться между собой. То есть, к примеру, если у вас небольшая компания, то аналитик может одновременно являться администратором ИБ и наоборот.</p>
          </div>
        </template>
        <template #conclusion>
          <p class="font-inter text-black">
            Подразделение по информационной безопасности играет ключевую роль. Отсутствие такого подразделения может привести к серьёзным последствиям как для компаний, так и для личности.
          </p>
        </template>
      </ConclusionContainer>
    </main>
  </div>
</template>

<script setup lang="ts">
import MainHeader from "~/shared/components/headers/MainHeader.vue";
import TopHeader from "~/shared/components/headers/TopHeader.vue";
import ConclusionContainer from "~/pages/methodology/_block/conclusion-container.vue";
import ArticleAlert from "~/pages/methodology/_block/article-alert.vue";
</script>

<style scoped>
strong {
  font-weight: 700;
}
a {
  @apply underline
}
</style>
